[ {"_id":"63cc53ff178425dd","companyName":"PayQwick, Inc.","jobTitle":".Net (C#) and Ionic Developer","jobType":"Full-time","jobLocation":"Calabasas, CA","date":"December 1, 2017","jobDescription":"<p><b>Looking for?</b></p><p>.Net Developer (Senior to Mid Level):</p><p>Will be working on C# web development projects including new development along with adding additional functionality to existing systems. Looking for a full-stack .Net developer with strong(hands on) Web API, MVC experience.</p><ul><li>Excellent C#, .Net Framework, OOAD and Software Design principles.</li><li>2 - 5 years of development experience with Node, Angular, Ionic &amp; TypeScript preferred.</li><li>5-7 years of experience with Microsoft SQL Server, PL/SQL.</li><li>5-7 years of experience with IIS.</li><li>Good understanding of ASP.Net, Web API, MVC, OData.</li><li>Experienced in building WCF/Web Services, JSON, XML interfaces.</li><li>Strong knowledge of application architecture and development patterns and Software Development Life Cycle.</li><li>Strong verbal and written skills with the ability to communicate technical concepts in business terms.</li><li>Modesty, capability to learn, collaborate and help others, be a team player</li><li>RECRUITERS PLEASE DO NOT CONTACT</li></ul><p><b>Who are we?</b></p><p>PayQwick, Inc. (&#x201C;PayQwick&#x201D; or the &#x201C;Company&#x201D;) a fast growing start-up in electronic-payment space, is a compliance - based electronic payment hub that enables state - legal marijuana commerce to transact throughout the entire supply chain. PayQwick ensures compliance with federal and state laws while minimizing cash transactions and increasing convenience and safety for both consumers and businesses. As such, PayQwick normalizes marijuana commerce by reducing the risk of violent crime, illegal money laundering and noncompliance with state marijuana laws. PayQwick began its operations in the State of Washington in October 2015 and is in the process of expanding in to other states where the sale of marijuana is legal, regulated and tracked by the state.</p><p>PayQwick has one of the most robust BSA/AML compliance programs in the cannabis industry, combining the functionality of a B2B electronic payment hub with a stringent compliance platform.</p><p>Job Type: Full-time</p>","jobApplication":"https://www.indeed.com/cmp/PayQwick,-Inc./jobs/Net-Ionic-Developer-63cc53ff178425dd"},
  {"_id":"1fbaf81eb0d59f83","companyName":"Greenroots Solutions","jobTitle":"Graphic Designer","jobType":"Full-time","jobLocation":"Los Angeles, CA 90012","date":"November 30, 2017","jobCompensation":"$52,000 a year","jobDescription":"<p>We are seeking a full time graphic designer and media manager. This is an on-site job in DTLA. We design packaging and branding for cannabis products.A knowledge of the California Weed Culture and an understanding of its influence on art ,music, design and marketing is a must. Looking for highly creative individual with a wild imagination.Must have excellent visual sensibility, advanced skills, a strong portfolio and work history, excellent references and be extremely professional and creative. Only serious designers with great portfolios will be considered. BFA or MFA and/or at least 5 years professional experience required. * ALSO LOOKING FOR INTERNS.Skills required: -Adobe CC Creative Suite (Illustrator, Photoshop, InDesign). -E-commerce website content updates.- ability to create cartoon graphics.-Knowledge of other design/media software or skills, such as photography or video, a plus but not required. -Social media savvy. -Tons of creative talent with the ability to generate new ideas and produce visually stunning work. -Ability to self-manage multiple projects skillfully and efficiently without supervision. -Excellent organizational skills and practices (including digital media computer files/archives organization).Job responsibilities include: Meet with clients design packaging and artwork fulfilling the clients needs.All graphic design related tasks from in-house layouts and printing to PR and media related layouts such as email blasts and social media updates.</p><p>Job Type: Full-time</p><p>Salary: $52,000.00 /year</p><p>Required education:</p><ul><li>Bachelor&apos;s</li></ul>","jobApplication":"https://www.indeed.com/cmp/Greenroots-Solutions/jobs/Graphic-Designer-1fbaf81eb0d59f83"},
  {"_id":"7423852fb3f20b2f","companyName":"CannabizTeam","jobTitle":"Master Grower","jobType":"Full-time","jobLocation":"Los Angeles, CA","date":"November 30, 2017","jobCompensation":"$90,000 - $100,000 a year","jobDescription":"<p><b>JOB TITLE -</b> MASTER GROWER</p><p><b>JOB SUMMARY</b></p><p>Manage a large-scale multi-warehouse industrial cannabis cultivation in a professional environment. Perform all the tasks in the grow to include cloning, transplanting, feeding plants, defoliation, topping, flushing, preventative sprays, trimming, packaging, inventory management and tracking.</p><p><b>DUTIES</b></p><ul><li>Perform all grow tasks including but not limited to: cloning, transplanting, feeding plants, defoliation, super cropping, topping, flushing, foliar and preventative sprays, trimming, packaging, waste disposal and inventory management.</li><li>Assist in hiring, training and scheduling staff and oversee entire staff through all processes including cloning, transplanting, topping, defoliating, trimming, packaging, etc.</li><li>Maintain and manage a large-scale multi-warehouse grow facility in a clean and organized work environment.</li><li>Develop and/or maintain grow warehouse protocols and nutrient regiment</li><li>Schedule plant maintenance and maintain organization to keep costs down</li><li>Track and catalog each strain from clone to flower to harvesting.</li><li>Execute preventative maintenance to eliminate mold, powdery mildew, spider mites, root aphids, fungus etc.</li><li>Mastery of various growing methods including aeroponics, micronutrients, beneficial bacteria, PH, PPM etc.</li><li>Knowledge and experience with container systems - hydro, coco, soil etc.</li><li>Expert knowledge of temperature, humidity, plant diseases, insects and fungi, and treatment</li><li>Constantly learning about new techniques, individual strains, high yield recipes, controlled stress, lighting and set ups.</li><li>Comprehensive knowledge of strains including Sativa, Indica and Hybrids and understand the medicinal implementation and effects of strains</li><li>Facility maintenance and troubleshooting as required</li></ul><p><b>SKILLS / QUALIFICATIONS</b></p><ul><li>Growing for 5+ years including at least 3 years at commercial operation as Master Grower.</li><li>Expertise and knowledge of large scale commercial plant grow including nutrient, mediums, lighting, temperature, humidity etc.</li><li>Expertise and knowledge of plant diseases, insects, fungi and treatments</li><li>Up to date and advanced knowledge of the cannabis plant growing techniques, new strains and genetics</li><li>Well organized and attention to detail is a must</li><li>Bachelor&apos;s degree in Horticulture, Science or Botany is preferred</li></ul><p><b>Job Type: </b> Full-time</p><p><b>Required education: </b> Bachelor&apos;s Degree</p><p><b>Required experience: </b> Commercial growing 3+ years as Master Grower</p><p>If this sounds like the position you have been waiting for, please reach out to us today - all inquiries are strictly confidential. Our focus is to assist you to make your best next career move, and we will not use your information for any other purpose.</p><p><i><b>When you apply, please state why you are interested in a career in the cannabis industry and list any previous industry experience.</b></i></p><p><i><b>CannabizTeam is a nationally based vertically integrated specialized staffing firm. Our executive team has over three decades of staffing experience and have a growing database of candidates with cannabis industry experience.</b></i></p><p><i><b>Please see our website at www.cannabizteam.com. We welcome the opportunity to partner with other businesses in the Cannabis Industry to help them hire exceptional talent and assure their business maintains a competitive advantage.</b></i></p><p><i><b>Apply online at www.cannabizteam.com/apply</b></i></p><p>Job Type: Full-time</p><p>Salary: $90,000.00 to $100,000.00 /year</p><p>Job Location:</p><ul><li>Los Angeles, CA</li></ul><p>Required education:</p><ul><li>Bachelor&apos;s</li></ul><p>Required experience:</p><ul><li>Commercial Growing: 3 years</li></ul><p>Required license or certification:</p><ul><li>Master Grower</li></ul>","jobApplication":"https://www.indeed.com/cmp/CannabizTeam/jobs/Master-Grower-7423852fb3f20b2f"},
  {"_id":"1fc44e9f8b6fcd1d","companyName":"Creative Healthcare Solutions, LLC","jobTitle":"Physician - Medical Cannabis Treatment Clinic","jobType":"Full-time","jobLocation":"Santa Monica, CA","date":"November 30, 2017","jobCompensation":"$175,000 - $185,000 a year","jobDescription":"<p><b>OPEN POSITION: </b> Physician - Medical Cannabis Treatment</p><p><b>SCHEDULE: </b></p><p>- Full-Time or Part-Time</p><p>- Open Monday through Friday, 9:00am to 6:00pm</p><p><b>COMPENSATION: </b></p><p>- $180,000 Annual Salary, negotiable dependent upon credentials (equivalent for part-time)</p><p>- Malpractice Insurance</p><p>- Benefits Package Negotiable</p><p><b>LOCATION: </b> Santa Monica, California</p><p><b>COMPANY PROFILE: </b> Since 2006, this clinic has offered medical/dosed cannabis treatments (via cannabis pills) to patients suffering from chronic and serious health conditions and who often cannot tolerate the side effects of other therapies. The practice is led by an experienced internal medicine physician, who believes in using medical cannabis as both an alternative and complementary therapy to other treatments. The practice employs a small, but dedicated, staff of 8 individuals, which includes 2 physicians and 1 psychiatrist.</p><p><b>POSITION DESCRIPTION: </b> The new physician will see an average of 6 to 8 patients per day. Appointments tend to be longer than average due to a focus on education and collaboration with patients. Approximately 70% of patients are referred by other providers due to inability to tolerate the side effects of pharmaceutical drugs. All patients are adults suffering from serious, chronic conditions; most are in some level of chronic pain. The practice utilizes an EHR. There are no evening, weekend, or on-call responsibilities.</p><p><b>REQUIREMENTS: </b></p><p>- California medical license</p><p>- DEA</p><p>- training in internal medicine or integrative medicine</p><p><b>HOW TO APPLY: </b> To apply for this position, please send your resume to Jenn Kunkel or call (773) 998-1272. Please visit www.chsrecruiting.com/job-board for a full list of available opportunities at Creative Healthcare Solutions.</p><p>Job Type: Full-time</p><p>Salary: $175,000.00 to $185,000.00 /year</p>","jobApplication":"https://www.indeed.com/cmp/Creative-Healthcare-Solutions,-LLC/jobs/Physician-1fc44e9f8b6fcd1d"},
  {"_id":"7bdb94635e8cf774","companyName":"TalentLogistiX","jobTitle":"Medical Marijuana Salesperson","jobType":"Full-time","jobLocation":"Arleta, CA","date":"November 30, 2017","jobDescription":"<p><b>Job Summary</b></p><p><b>This position will include making cold-calls to dispensaries that do not carry our products, making an introduction, and selling them on an order.</b></p><p><b>This position will involve taking incoming calls from dispensaries that are already our customers; and creating their order, based on current inventory. Person will be responsible for ensuring real-time communication with other sales-staff in regards to current inventory available, and what is immediately being used from inventory for orders being placed at any given time.</b></p><p><b>The person for this position must have heavy phone-sales experience. They must be proficient with Excel and generally, computer savvy. Ability to quickly, and accurately, enter orders is of utmost importance; quick mathematical thinking is imperative, as our inventory is constantly changing with every order. Invoicing will also be a responsibility of this position.</b></p><p><b>Knowledge of cannabis products is a must. This must include knowledge of cannabis extracts (Wax, butter, cake batter, shatter, rosin, sauce, CBD)</b></p><p><b>A cursory knowledge of vape pens would also be helpful, but not required</b></p><p><b>Hours are 10-6 Mon-Fri and potentially 1-2 Saturdays/month</b></p><p>Job Type: Full-time</p><p>Required experience:</p><ul><li>medical marijuana: 2 years</li></ul>","jobApplication":"https://www.indeed.com/cmp/TechTrades-Corporation/jobs/Medical-Marijuana-Salesperson-7bdb94635e8cf774"},
  {"_id":"6128757d9e5ba55b","companyName":"Cura CS LLC","jobTitle":"Compliance Specialist","jobType":"Full-time","jobLocation":"Burbank,","date":"November 28, 2017","jobDescription":"<p>The Compliance Specialist is proficient at conducting regulatory research and analysis to ensure day to day compliance. Experienced in drafting operational procedures that meet all state and local regulations. Adept in conducting monitoring for operational processes and procedures, reviewing and analyzing data for compliance and implementing policies to ensure full compliance at all regulatory levels.</p><p>The Compliance Specialist is also skilled in using Seed-to-Sale traceability software, implementing training protocols and procedures, performing weekly/monthly audits ensuring compliance at all time. Strong analytical understanding of data entry to meet accuracy requirements of the state&apos;s Seed-to-Sale software.</p><p>Experienced in inventory control, implementing programs that physically account for on hand inventory</p><p>RESPONSIBILITIES</p><ul><li>Operational procedural assessment from a compliance standpoint</li><li>Safety and regulatory compliance based on OSHA and CGMP guidelines</li><li>Legislative and regulatory research applicable to State and local rules</li><li>Compliance training based on State and local regulations</li><li>Seed-to-Sale Software administration and training (METRC)</li><li>Drafting standard operation procedures based on state and local guidelines</li></ul><p>JOB QUALIFICATIONS</p><ul><li>Thorough knowledge of all applicable state and local cannabis regulations</li><li>Professional experience in compliance</li><li>Extensive knowledge of Biotrack, MJ Freeway, METRC, or any other applicable cannabis based Seed-to-Sale or P.O.S. software. Administrative responsibilities a major plus.</li><li>Must be well adept in Google Suite or Microsoft Office.</li><li>Strong analytical skill set and detail oriented</li></ul><p>COMPENSATION</p><p>Compensation depends on experience. Full-time Cura employees are eligible for Medical, Dental and Vision benefits after 60 days of employment.</p><p>Job Type: Full-time</p>","jobApplication":"https://www.indeed.com/cmp/Cura-CS-LLC/jobs/Compliance-Specialist-6128757d9e5ba55b"},
  {"_id":"615b216e7c70325b","companyName":"Budsy","jobTitle":"Virtual Budtender/Business Development/Social Media","jobType":"Full-time","jobLocation":"Los Angeles, CA","date":"November 28, 2017","jobDescription":"<p><b>Job Summary</b></p><p>Hi,</p><p>We&apos;re Budsy, a cannabis tech start-up based in West Hollywood offering one-touch personalized delivery. We&apos;re rapidly growing and are looking to add another member to our team.</p><p>Our ideal candidate is self-motivated, driven, professional, a people person, can work independently in a start-up environment, and of course, passionate about cannabis. The candidate must be based in LA and have a minimum of a year&apos;s experience in the cannabis industry.</p><p><b>Responsibilities and Duties</b></p><p>The role comes with the following duties:</p><p><i>Operations</i></p><p>You will match people placing orders with the best strain that fits their profile. In essence, the same task as a budtender, but done through a virtual dashboard. The candidate we&apos;re looking for has an expansive knowledge of cannabis strains and is great at providing quality customer service.</p><p><i>Business Development</i></p><p>You will reach out to dispensaries and other potential partners to establish and maintain a business relationship with Budsy. Our ideal candidate is active in the cannabis community or is looking to get their foot in the door.</p><p><i>Social Media</i></p><p>You will post and maintain our presence on our social networks. The ideal candidate has experience managing social media accounts, can independently create visual content and written copy, and has a friendly and engaging, yet professional online persona.</p><p>Job Type: Full-time</p><p>Job Location:</p><ul><li>Los Angeles, CA</li></ul><p>Required education:</p><ul><li>Bachelor&apos;s</li></ul><p>Required experience:</p><ul><li>budtending/cannabis industry: 1 year</li><li>customer service: 2 years</li><li>social media: 1 year</li></ul><p>Required license or certification:</p><ul><li>Driver&apos;s License</li></ul>","jobApplication":"https://www.indeed.com/cmp/Budsy/jobs/Virtual-Budtender-Business-Development-Social-Media-615b216e7c70325b"},
  {"_id":"036f117c9c972b34","companyName":"Distribution Made Simple","jobTitle":"Outside Sales Representative","jobType":"Full-time","jobLocation":"Los Angeles, CA","date":"November 28, 2017","jobCompensation":"$25,000 a year","jobDescription":"<p>The Sales Representative reports directly to the Sales director.<br>The following duties include and are not limited to Customer Service, Service and Sales Responsibilities:</p><p>Sales Expectations</p><ul><li>Learn company&#x2019;s products and the science behind the products</li><li>Present, demonstrate and professionally sell current and future product lines</li><li>Open new accounts. A minimum of 3 and a maximum of 5 stores per week.</li><li>Establish, develop and maintain exceptional and professional customer relationships with decision-makers; owners and buyers.</li><li>Utilize and learn all aspects of inter-company software: salesforce, geomapping and Design Forest</li><li>Stay up-to-date with competitor sales and marketing strategies.</li></ul><p>In&#x2013;Store Activations (Weekly on Fridays):</p><ul><li>Provide samples, marketing materials and knowledge to in store staff</li></ul><ul><li>Promote the products to customers in store.</li></ul><ul><li>Promote sales from within.</li></ul><p>Administration duties<br>General office and sales administrative duties</p><ul><li>Preparation of weekly sales reports for progress</li><li>Compliance of local laws and guidelines pertaining to safe handling of all cannabis products</li><li>General office administration duties and other tasks as required for the success of the assigned region</li></ul><p>After 90 days of employment a 2 week paid-time off personal leave will go into effect on an accrual basis which will be available for sick, vacation and personal leave.<br>***A valid California medical recommendation, driver&#x2019;s license and vehicle insurance must be active at all times.</p><p>Job Type: Commission</p><p>Salary: $25,000.00 /year</p>","jobApplication":"https://www.indeed.com/cmp/Distribution-Made-Simple/jobs/Outside-Sales-Representative-036f117c9c972b34"},
  {"_id":"4f893eba2dee77c0","companyName":"WALNUT LLC","jobTitle":"Cultivation Technician","jobType":"Full-time","jobLocation":"Long Beach, CA 90807","date":"November 29, 2017","jobDescription":"<p><b>Job Summary</b></p><p>Seeking entry level Cultivation Technician position in Long Beach California.</p><p><b>Responsibilities and Duties</b></p><p><b>CULTIVATION TECHNICIAN JOB RESPONSIBILITIES</b></p><ul><li>Maintain plant health throughout the cultivation process.</li><li>Daily monitoring of irrigation</li><li>Maintain good agricultural practices.</li><li>Maintain accurate records, inventories, and data as needed.</li><li>Perform other tasks as required.</li></ul><p><b>CULTIVATION TECHNICIAN SUPERVISORY RESPONSIBILITY: </b></p><ul><li>Enforce standard operational procedures.</li><li>Enforce company policy and mediate disputes.</li><li>Ensure compliance throughout the cultivation process in conjunction with the Cultivation Specialist and Cultivation Manager.</li><li>Enforce the anti-diversion policy.</li></ul><p><b>Qualifications and Skills</b></p><p><b>CULTIVATION SPECIALIST SKILLS AND QUALIFICATIONS: </b></p><ul><li>Commitment to Quality</li><li>Results Focus</li><li>Attention to Detail</li><li>Communication Skills</li><li>Safety</li></ul><p><b>ADDITIONAL ELIGIBILITY QUALIFICATIONS: </b></p><ul><li>Military Experience</li><li>Team Building / Development Courses</li></ul><p><b>PHYSICAL DEMANDS</b></p><p>The employee is occasionally required to stand, walk, use hands to finger, handle or feel; and reach with hands and arms. The employee must occasionally lift and/or move up to 50 pounds. Use hands and fingers to grasp, move, or assemble objects. Reacts quickly using hands, fingers, or feet. Bend, stretch, twist, or reach out. Make fast, repeated movements of arms, wrists, hands, and fingers. The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job.</p><p>Job Type: Full-time</p><p>Job Location:</p><ul><li>Long Beach, CA 90807</li></ul>","jobApplication":"https://www.indeed.com/cmp/3088-WALNUT-LLC/jobs/Cultivation-Technician-4f893eba2dee77c0"},
  {"_id":"6ff85b8bbb1418e0","companyName":"Green Valley Collective","jobTitle":"Budtender","jobType":"Part-time","jobLocation":"North Hollywood, CA","date":"November 28, 2017","jobCompensation":"Part-time","jobDescription":"<p><b>Job Summary</b></p><p>Looking for knowledgeable, organized, and friendly Budtenders. 21+</p><p>Job Type: Part-time</p>","jobApplication":"https://www.indeed.com/cmp/Green-Valley-Collective/jobs/Budtender-6ff85b8bbb1418e0"},
  {"_id":"2f1f3d5fd45d07f7","companyName":"CANN Media Group, LLC.","jobTitle":"Experienced Sales Associate","jobType":"Full-time","jobLocation":"Woodland Hills, CA","date":"November 28, 2017","jobCompensation":"$70,000 - $150,000 a year","jobDescription":"<p><b>Job Summary</b></p><p>Sales Associate, CANN Media</p><p><b>THE COMPANY</b></p><p>CANN Media Group, LLC (CMG) is a national business-to-business (B2B) media organization serving the emerging cannabis and hemp industries. Our products include: events, publications, digital offerings and social media marketing.</p><p><b>THE INDUSTRY</b></p><p>Legal marijuana is one of the fastest-growing business sectors in the United States, and as legalization expands cannabis will soon be included among the world&apos;s leading industries. Business sectors include: horticulture and agriculture, biopharm, alternative medicine, retail and distribution.</p><p><b>OVERVIEW</b></p><p>The Account Executive is responsible for managing a pipeline of sales opportunities, prospecting, establishing and maintaining relationships, and presenting clients with custom marketing solutions. Ideal candidate should be highly experienced in advertising sales and corporate communication. Candidate should be energetic, professional, persuasive, well organized, and comfortable with presenting to small and large companies and agencies. Must also be able to travel frequently to meet with clients and attend trade functions and events.</p><p>CMG is seeking an in-house, well qualified, passionate and goal driven media sales professional to work in our Woodland Hills office.</p><p><b>Responsibilities Include: </b></p><ul><li>Allocating the time required to gain a complete understanding of the market and market needs.</li><li>Achieve monthly and quarterly sales targets.</li><li>Prepare insertion orders.</li><li>Actively meeting with clients to further the business relationship.</li><li>Maintain an active list of accounts while developing new business.</li><li>Prepare for client meetings, presentations and brainstorming sessions.</li><li>Develop and maintain excellent relationships with clients and agencies through identifying clients&#x2019; advertising needs and developing customized solutions to meet those needs.</li><li>Create sales and marketing sponsorship/promotion plans, literature and advertising proposals for clients.</li><li>Work with internal departments to manage account stewardship.</li><li>Attend sales meetings, training sessions and client meeting and promotions</li><li>Understand and communicate the resources, products and capabilities of all CANN Media assets.</li></ul><p><b>Requirements: </b></p><ul><li>A passion for the cannabis industry.</li><li>Minimum of 5 years of direct sales experience.</li><li>Comprehensive understanding of social media platforms and how to leverage them effectively.</li><li>Relationship builder with an engaging personality.</li><li>Goal driven and self-motivated individual that challenges self to exceed targets.</li><li>Ability and experience selling multi-platform advertising programs that include print, digital, social and influencer marketing.</li><li>Excellent written, verbal, communication and interpersonal skills.</li><li>Ability to multi-task and work in a high pressured, fast-paced environment.</li><li>Strong written, presentation, marketing and closing skills.</li><li>Bachelor&#x2019;s degree and relevant work experience.</li><li>Proficiency of Microsoft Office products: MS Word, Excel and PowerPoint required.</li><li>SalesForce experience is a plus.</li></ul><p><b>Eligibility Requirements: </b></p><ul><li>Must be willing to work in Woodland Hills, CA office.</li><li>Must be willing and able to travel.</li><li>Must have a valid driver&#x2019;s license, good driving record and valid insurance.</li><li>Must have legal authorization to work in the United States.</li><li>Must be 21 years or older.</li></ul><p><b>Compensation: </b></p><ul><li>Compensation programs are salary + commission + bonus + profit sharing.</li><li>Base salary is dependent on a variety of factors and starts at $45k.</li><li>Total annual compensation packages range from $70k to $150k.</li></ul><p><b>Application Requirements: </b></p><ul><li><i>Do not contact company directly, no phone solicitations will be accepted.</i></li><li><i>Please include a cover letter communicating why you feel you would be a good candidate for this position.</i></li></ul><p><i>CANN Media Group is a premier media company renowned for producing the highest quality content for the world&apos;s most influential cannabis audiences and attracts more engagement than any other B2B brand in the cannabis industry. The company&#x2019;s portfolio includes iconic platforms such as mg Magazine, CBD Today and mgretailer.com.</i></p><p>Job Type: Full-time</p><p>Required education:</p><ul><li>Bachelor&apos;s</li></ul><p>Required experience:</p><ul><li>Sales: 5 years</li></ul><p>Required travel:</p><ul><li>25%</li></ul>","jobApplication":"https://www.indeed.com/cmp/CANN-Media-Group,-LLC/jobs/Experienced-Sales-Associate-2f1f3d5fd45d07f7"},
  {"_id":"ffd91c948d59cead","companyName":"Kushie Brand","jobTitle":"Assistant","jobType":"Full-time","jobLocation":"Lakewood, CA","date":"November 28, 2017","jobCompensation":"$12 - $16 an hour","jobDescription":"<p>We are a fast growing marijuana brand, and are expanding our team to help get legal medical marijuana products into dispensaries and delivery retailers.</p><p>If you have experience in field office assistant and want to enter an industry with unparalleled opportunity where you can also help people, then this could be a great opportunity for you.</p><p>We are one of the very few businesses in California that completely follow all State and Federal laws, running as a compliant operation under the cannabis laws in California. As retailer under the new requirements created in the Medical Marijuana Regulation and Safety Act, we are building a business to help the State uphold the new distribution model, and are excited about the incredible opportunity it presents.</p><p><b>Responsibilities and Duties</b></p><p><b>-</b> Manage and maintain smooth operations of the office including office supplies procurement, vendor management, filing sensitive documents, booking travel for employees and supporting marketing team as needed.</p><p>- Acts as direct liaison with talent</p><p>- Creates and maintains database and spreadsheet files</p><p>- Composes and prepares confidential correspondence, reports, and other documents</p><p><b>Qualifications and Skills</b></p><p>2-3 years experience in similar position is preferred.</p><p>Must be authorized to work in United States. Must be able to lift up to 30 pounds on occasion. Must have reliable transportation including a valid driver&apos;s license and current auto insurance.</p><p>Job Types: Full-time, Part-time</p><p>Salary: $12.00 to $16.00 /hour</p><p>Required education:</p><ul><li>High school or equivalent</li></ul><p>Required license or certification:</p><ul><li>CA</li></ul>","jobApplication":"https://www.indeed.com/cmp/Kushie-Brand/jobs/Assistant-ffd91c948d59cead"},
  {"_id":"8210f178e708dd71","companyName":"Zero Point Distribution","jobTitle":"Supply Chain Manager","jobType":"Full-time","jobLocation":"Long Beach, CA","date":"November 28, 2017","jobDescription":"<p><b>Job Summary</b></p><p>You must be ready to manage a multi-million dollar supply chain of high-value assets in Americas fastest growing Industry!</p><p>Zero Point Distribution, a Medical Cannabis distribution company focused on 3rd party supply chain management that will revolutionize the industry through automation, blockchain, and IoT. We are looking for the Supply Chain Manager who can plan, manage and execute an effective Supply Chain from Cultivator to Consumer in accordance with State and Local regulations in a highly regulated industry requiring Track and Trace and strict packaging and labeling requirements.</p><p>As Supply Chain Manager, you will manage fiscal responsibility including budget preparation, labor, supply, and cost management and comply 100% with all State and Local regulations for Medical Cannabis distribution.</p><p><b>Responsibilities and Duties</b></p><p><b>Responsibilities</b></p><ul><li>Lead and execute all aspects of supply chain management including purchasing, procurement, quality control, inventory, production, logistics, innovation and consumer satisfaction.</li><li>Documentation &amp; Organization: Create, manage and implement standard operating procedures and distribution operating plan</li><li>Metrics &amp; Reports: Manage, track, and report on quantified metrics and key performance indicators in support of internal objectives and as a basis to monitor and influence all aspects of supplier performance.</li><li>Innovation &amp; Quality Control: Provide cost comparison evaluations for new vendors, and suppliers.</li><li>People &amp; Relationship Management: the ability to manage people (buyers, planners, warehouse personnel, production personnel, office staff, etc.) and build successful internal and external relationships is a critical element of this role.</li></ul><p><b>Duties</b></p><ul><li>Ensure 100% compliance with Metrc software using 3rd party ERP &quot;Seed to Sale&quot; software</li><li>Optimize ERP and MRP systems</li><li>Organize, build, train and lead a highly competent team to deliver optimal performance</li><li>Lead continuous improvement of operational performance, and plan and execute milestones associated with continued growth, expansion, and optimization</li><li>Clearly assigns responsibility for tasks and decisions; set clear objectives; monitor progress and results</li><li>Identify candidates for strategic relationships based on seasonality, pricing, capability/capacity and quality</li></ul><p><b>Qualifications and Skills</b></p><p><b>Education</b></p><ul><li>BS in Industrial or Systems Engineering, Logistics, Supply Chain, or related field. Master&apos;s Preferred</li></ul><p><b>Previous Job Experience</b></p><ul><li>(4+ years) CPG supply chain management and leadership background in food, beverage or pharma industry</li><li>Managed warehouse operations including purchase orders, inventory mgnt, receiving, packing, storage, shipping</li><li>Experienced in supply chain engineering including operational layout, design of material handling equipment and automated systems, storage systems and equipment, etc.</li><li>Developed and used supply chain analytics and decision support tools for supply chain design and improvement, with exposure to best practices</li><li>Strong program or project management experience.</li><li>Proven capability to work with people at all levels of an organization</li><li>Possess strong analytical, statistical / process analysis background and some simulation experience.</li><li>Familiar with latest in automated warehouse and packing Equipment</li><li>Familiar with Serialization, IoT, IoP, QR codes</li><li>Familiar with Co-packing and International Orders</li><li>Must have the ability to be successful in conditions which include multiple and sometimes conflicting priorities, extended work schedules and demanding deadlines; with demonstrated ability to excel in a hands-on, fast paced entrepreneurial environment</li><li>Highly adaptable and resourceful</li></ul><p><b>Certifications</b></p><p>APICS certification Preferred</p><p><b>Ideal Characteristics</b></p><ul><li>You&#x2019;re a Planner &amp; Problem Solver: Highly organized and detail oriented, superb project management capability along with excellent written/oral communication. Relentless work style gets the job done every time!</li><li>You&#x2019;re a Relationship Manager: You have an uncanny ability to build relationships and create opportunities to meet and exceed budget goals.</li><li>You&#x2019;re a Stickler for Details: You triple check your work to ensure accuracy and consistency. You leave nothing for chance.</li><li>You&#x2019;re a Master Negotiator: You never accept the first price as the final price and always leverage opportunities for margin improvement.</li><li>You&apos;re a Cannabis Lover: This will be a demanding role that will require continuous performance, you must be intrinsically motivated by love for Cannabis and a vision to revolutionize our world.</li></ul><p><b>Benefits</b></p><ul><li>Stock Options</li><li>Healthy Workplace -</li><li>Free Breakfast</li></ul><p>Job Types: Full-time, Part-time, Contract</p><p>Job Location:</p><ul><li>Los Angeles, CA</li></ul><p>Required education:</p><ul><li>Master&apos;s</li></ul><p>Required experience:</p><ul><li>Supply Chain Management: 5 years</li><li>Cannabis Industry: 2 years</li></ul>","jobApplication":"https://www.indeed.com/cmp/Cannaco-Supply/jobs/Supply-Chain-Manager-8210f178e708dd71"},
  {"_id":"494ba130ea95279f","companyName":"WALNUT LLC","jobTitle":"QUALITY / COMPLIANCE ANALYST","jobType":"Full-time","jobLocation":"Long Beach, CA 90807","date":"November 29, 2017","jobDescription":"<p><b>Job Summary</b></p><p>Maintains legal and regulatory compliance for track and trace program for organization by participating, researching and communicating requirements; obtaining approvals.</p><p><b>Responsibilities and Duties</b></p><p><b>COMPLIANCE ANALYST JOB DUTIES: </b></p><ul><li>Ensures Compliance with California Business and Professional Code; Division 10 Cannabis</li></ul><ul><li>Verifies and engages in Track and Trace Activities required by the Organization.</li><li>Ensures State and Local Compliance reporting is completed.</li><li>Researches ways to increase efficiency in Track and Trace activities.</li><li>Researches regulations by reviewing regulatory bulletins and other sources of information.</li><li>Ensures operations following specific rules related to Compliance.</li><li>Prepares reports by collecting, analyzing, and summarizing information.</li><li>Maintains quality service by establishing and enforcing organization standards.</li></ul><p><b>Qualifications and Skills</b></p><p><b>COMPLIANCE ANALYST SKILLS AND QUALIFICATIONS: </b></p><p>Legal Compliance, Thoroughness, BPC Division 10 Rules, Research Skills, Reporting Research Results, Coordination, Audit, General Math Skills</p><p>Job Type: Full-time</p><p>Job Location:</p><ul><li>Long Beach, CA 90807</li></ul><p>Required education:</p><ul><li>Bachelor&apos;s</li></ul><p>Required experience:</p><ul><li>Quality: 2 years</li></ul>","jobApplication":"https://www.indeed.com/cmp/3088-WALNUT-LLC/jobs/Quality-494ba130ea95279f"},
  {"_id":"9002298f81cbdab1","companyName":"Bleecker Street Playhouse","jobTitle":"Business/Finance Intern","jobType":"Part-time","jobLocation":"Los Angeles, CA","date":"November 27, 2017","jobDescription":"<p><b>Job Summary</b></p><p>Bleecker SP is a boutique branding strategy &amp; creative studio based in Los Angeles and New York City. Founded in 2012, BSP collaborates with select clients on developing their unique visions through innovative strategies, creative services, design, and global communication campaigns. BSP also integrates brands with A-list celebrities, social entrepreneurs, musicians and rising TV, film, and internet stars to grow audiences, generate press coverage, build market share and launch new brands.</p><p>Our clients include Absolut Vodka, Bionic Yarn, Chivas, Cond&#xE9; Nast, Facebook, Flint Studios, Future of Storytelling, H&amp;M, The Knight Foundation, Persol, Ray-Ban, TED, Wired, Vanity Fair.</p><p>You can view our work at www.bleeckersp.com</p><p><b>Job Overview</b></p><p>We are looking for a business or finance focused intern to help us grow our small LA studio, support some amazing fashion and cannabis projects, and grow with us as we build a world-class creative studio. You should be fun, creative, dynamic, have built great relationships, not afraid of European spreadsheets, focused, hardworking, trustworthy, looking for a home to spread your wings, are an entrepreneur at heart, culturally aware, flexible, and love LA and NY!</p><p>This part-time internship provides support to the studio finance team, reporting to the CEO and/or an Account Manager/Director. The business or finance intern is responsible for communicating closely with the larger team and supporting on current projects. The Ideal candidate has a creative studio/agency or industry background and experience in finance or interested in developing their career in finance in the fashion and lifestyle and cannabis industry.</p><p>Our job is to support your ability to deliver all projects in a clean and swift manner, to best manage and grow meaningful client relationships, to manage studio partnerships with grace and leverage those partnerships, and ensure you have the tools needed to deliver best-in-class client service each and every day.</p><p><b>Responsibilities and Duties</b></p><p>Responsibilities</p><ul><li>Act as business intern on financial projects and related correspondence</li><li>Conducting market research, following trends, and discovering insights.</li><li>Research and analyze competitor marketing and sales materials.</li><li>Work with the finance team on financial forecasting efforts</li><li>Assist with month-end financial reports</li><li>Expense reporting and project budgeting</li><li>Be in support of the full team on all initiatives</li><li>Anticipate problems and react in a timely and efficient way</li><li>Overall brand ambassador for BSP</li></ul><p><b>Qualifications and Skills</b></p><ul><li>2+ years of finance/accounting experience with a professional services firm, agency experience preferred</li><li>Driven, energetic, and goal-oriented with keen attention to detail and quality of deliverables</li><li>Autonomous and passionate</li><li>Work well under pressure and tight timelines, having solid stress management skills</li><li>Logical, work-oriented and analytical with excellent attention to detail</li><li>Flexible, curious, strategic thinker and a true problem solver, with capabilities of working on several projects and tasks at a time</li><li>Enthusiastic and team-spirited with excellent interpersonal skills and demonstrated client relationship skills</li><li>Excellent communication skills (including writing, editing, and proofreading) are essential</li><li>Strong organizational and time management skills</li><li>Ability to prioritize and execute multiple assignments while working under tight deadlines</li><li>Overall go to person and social chameleon</li><li>Flexible working hours and the ability to work remotely if necessary</li><li>Proficient in Mac software</li><li>Proficient in all MS Office programs and Google Suite (Docs, Spreadsheets, Calendar)</li><li>Working knowledge of Adobe Creative Suite (Photoshop, InDesign, Lightroom, Illustrator) is a plus</li></ul><p>Job Types: Part-time, Internship</p><p>Job Location:</p><ul><li>Los Angeles, CA</li></ul><p>Required education:</p><ul><li>Bachelor&apos;s</li></ul><p>Required experience:</p><ul><li>finance/accounting: 2 years</li></ul>","jobApplication":"https://www.indeed.com/cmp/Bleecker-Street-Playhouse/jobs/Business-Finance-Intern-9002298f81cbdab1"},
  {"_id":"d40aa94a9c631a23","companyName":"Biohazard Inc.","jobTitle":"Product Photographer","jobType":"Full-time","jobLocation":"Commerce, CA","date":"November 27, 2017","jobCompensation":"$17 - $19 an hour","jobDescription":"<p><b>Job Summary</b></p><p><b>Summary: </b></p><p>&quot;BioHazard Inc. is the largest distributor of cannabis packaging in the Los Angeles area. If you&#x2019;re looking for an emerging company that is not your typical wholesaler, BioHazard may be the company that fits your creative personality. Join our team of ambitious and focused players in an industry that is on the verge of taking off. BioHazard is projected to increase sales exponentially in the next few years. You can be at the forefront of our incredible growth while working toward promotion within our company. If you&#x2019;re ambitious, self-motivated and have strong social skills, we want to get to know you!&#x201D;</p><p>The Product Photographer is primarily responsible for photographing and editing company products for its e-Commerce website.</p><p><b>Essential Functions: </b></p><ul><li>Consults with Graphic Designer to evaluate individual project needs.</li><li>Prepares and edits photographic pictures.</li><li>Produces layout photographs for Graphics Designer to view prior to any type of Photoshop.</li><li>Presents samples of photographs to Graphic Designer for selection and approval.</li><li>Reviews final layout and suggests improvements as needed, and presents final layout to Graphics Designer or for approval.</li><li>Reviews quality of final product before release to Graphics Designer.</li><li>Maintains image resource files.</li><li>Performs other related duties as needed to meet department demands.</li></ul><p><b>Job Qualifications: </b></p><ul><li>Associate&apos;s degree (A.A.) from two-year college or university; or two to three years of related experience and/or training; or equivalent combination of education and experience. Bachelor&#x2019;s degree (B.A.) is a plus</li><li><b>Must</b> have two to three years of photographic experience with product displays</li><li><b>Must</b> have two to three years of experience with Photoshop.</li><li><b>Must</b> have a minimum of 2 years of experience with Final Cut Pro or similar software.</li><li><b>Experience</b> in MAC products is required.</li><li><b>Experience</b> in outside photo shoots is required.</li><li><b>Experience</b> in Videography and script writing a plus.</li><li>Ability to write routine reports and correspondence.</li><li>Ability to add, subtract, multiply, and divide in all units of measure, using whole numbers, common fractions, and decimals.</li><li>Ability to apply common sense understanding to carry out instructions furnished in written, verbal or diagram form.</li></ul><p><b>Computer Skills: </b></p><p>To perform this job successfully, an individual should have knowledge of Adobe Creative Suite software and Internet software, as well as be proficient in MS Office suite (Excel, Word, Outlook and PowerPoint).</p><p><b>Physical Requirements: </b></p><p>The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.</p><p>While performing the duties of this job, the employee is regularly required to hear. The employee is frequently required to stand in one place for extended periods of time.</p><p>The employee must occasionally lift and/or move up to 25 pounds.</p><p>Specific vision abilities required by this job include close vision, distance vision and color vision.</p><p><b>Work Environment: </b></p><p>The work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.</p><p>The noise level in the work environment is moderate to loud.</p><p><b>Job Type</b> :</p><ul><li>Full-time</li></ul><p><b>Required education</b> :</p><ul><li>AA or Bachelor&#x2019;s degree.</li></ul><p><b>Required experience</b> :</p><ul><li>Product Photography: 2-3 years</li></ul><p><b>Benefits</b></p><p>eligible for group medical, dental and vision benefits the 1st of the month after 60 days of employment.</p><p>Job Type: Full-time</p><p>Salary: $17.00 to $19.00 /hour</p><p>Required education:</p><ul><li>Associate</li></ul><p>Required experience:</p><ul><li>Photoshop: 2 years</li><li>photographic: 2 years</li><li>Final Cut Pro: 2 years</li></ul>","jobApplication":"https://www.indeed.com/cmp/bio-hazard-inc./jobs/Product-Photographer-d40aa94a9c631a23"},
  {"_id":"fe959b471f5f261f","companyName":"THC Design","jobTitle":"Plant Tissue Research Scientist","jobType":"Full-time","jobLocation":"Los Angeles, CA","date":"November 27, 2017","jobDescription":"<p>THC Design is seeking a Plant Tissue Research Scientist to join our rapidly growing Los Angeles-based team. The Plant Tissue Research Scientist will be responsible for running a plant tissue culture lab and provide insight for the entire process. The successful candidate will be self-motivated and self-reliant.</p><p><b>Responsibilities: </b></p><ul><li>Produce a minimum of 8,000 plant tissue cultures per month.</li><li>Provide technical knowledge in designing and establishing at plant tissue culture lab.</li><li>Follow laboratory safety guidelines.</li><li>Develop efficient protocols for micropropagation, genetic transformation and embryogenesis of cannabis.</li><li>Manage and supervise plant tissue culture procedures and experimentation.</li><li>Write laboratory reports, test plans/protocols, SOPs and design of experiment (DOE).</li><li>Prepare media recipes, autoclave supplies and maintain basic lab organization.</li></ul><p><b>Essential Qualifications: </b></p><ul><li>BS in Plant Biology, Biology, Biochemistry, Microbiology, Molecular Biology, Agronomy or similar field.</li><li>2+ years lab experience</li><li>Understanding of aseptic technique.</li><li>Demonstrated initiative and implementation of mid and long term strategic goals.</li><li>Demonstrated self-discipline, ability to function effectively without direct supervision, and ability to work effectively with others.</li><li>Able to provide general direction to various team members.</li><li>High attention to detail.</li><li>Proficient with MS Office other standard computer and software systems.</li><li>Able to effectively communicate, written and verbal.</li></ul><p><b>Preferred Qualifications: </b></p><ul><li>Passion for working with plants and cannabis.</li><li>Experience taking a leadership role within interdisciplinary teams.</li><li>Motivation to learn daily.</li></ul><p>Job Type: Full-time</p><p>Job Location:</p><ul><li>Los Angeles, CA</li></ul><p>Required education:</p><ul><li>Bachelor&apos;s</li></ul><p>Required experience:</p><ul><li>Research: 2 years</li><li>Aseptic Technique: 4 years</li><li>Micropropagation: 4 years</li></ul>","jobApplication":"https://www.indeed.com/cmp/THC-Design/jobs/Plant-Tissue-Research-Scientist-fe959b471f5f261f"},
  {"_id":"4680c60f47307bf0","companyName":"Feel Good Sales Group","jobTitle":"Regional Sales Representative","jobType":"Full-time","jobLocation":"Los Angeles, CA","date":"November 26, 2017","jobDescription":"<p>Feel Good Sales Group (FGSG) is looking for regional sales reps across California. Applicants should be experienced in sales, entrepreneurial minded, highly motivated, reliable and passionate about cannabis.</p><p>About FGSG:</p><p>A more comprehensive and professional sales solution for cannabis brands.</p><p>Position Summary:</p><p>While this industry is super freakin&#x2019; cool, exciting and booming with opportunity, it is a lot more challenging and dynamic than you would expect. The reality of being an outside sales rep is extremely demanding. Dealing with often unorganized, unreliable and unprofessional people can be frustrating and this industry is full of them. Most buyers at dispensaries are difficult to find and get a hold of. Dispensaries will strategically keep outsiders from knowing who the buyer is.</p><p>To be successful, you will need to be resilient, tenacious, organized and cool-as-a-fan. Suits and squares don&#x2019;t get far in this industry, but neither do unprofessional stoners.</p><p>As a FGSG sales rep you will be representing some of the most reputable cannabis brands to dispensaries and deliveries. You will work with other bright, healthy hustlers like yourself, under supportive management. Your job will be to maximize sales in your territory by opening, servicing and managing accounts, cultivating meaningful relationships, providing superior service and support, promotions, inventory management, merchandising and weekly reporting.</p><p>This is an extremely unique opportunity to get into the cannabis industry with a good company.</p><p>Job Description:</p><ul><li>Visiting accounts, calling, emailing, logging everything into our CRM, following up persistently, selling, promoting and lots of following up.</li><li>Open new accounts &#x2013; Identify and qualify key accounts, set up appointments, and present our brands to buyers.</li><li>Cultivate personal relationships &#x2013; Continually engage with dispensary staff and patients, building trust, brand loyalty and sales through continual face-to-face interaction as well as phone, email and social network.</li><li>Telling our brands&#x2019; stories in a passionate and compelling way, educating bud-tenders about what makes our brands&#x2019; products special, and stoking them out!</li><li>Sampling and promotions &#x2013; Develop and execute promos to drive more patients to dispensary accounts and build brand awareness</li><li>Increase brand and product awareness</li></ul><ul><li>Educate patients about our brands&#x2019; products</li></ul><ul><li>Encourage trial of products through sampling</li></ul><ul><li>Driving sales through promotional offers</li></ul><ul><li>Push awareness of events through social media</li></ul><ul><li>Inventory Management &#x2013; Stay diligently on top of inventory to maximize sales.</li><li>Merchandising &#x2013; Ensure that our brands&#x2019; products are optimally positioned and merchandised with display units, POP and collateral.</li><li>Weekly Reports</li></ul><p>Job Requirements</p><ul><li>3+ years of sales experience</li><li>Cannabis industry and product knowledge is a big plus</li><li>Valid driver&#x2019;s license</li><li>Medical marijuana physician recommendation</li><li>Employment background check</li></ul><p>Perks</p><ul><li>Be part of a fun, successful, synergetic and rewarding team of awesome people</li><li>Work in a booming industry that is helping improve lives physically, mentally, emotionally, spiritually, financially, and socially.</li><li>Lots of opportunities for growth</li><li>Learn a ton about a new and emerging industry</li></ul><p>Job Type: Full-time</p><p>Job Location:</p><ul><li>Los Angeles, CA</li></ul><p>Required education:</p><ul><li>Bachelor&apos;s</li></ul><p>Required experience:</p><ul><li>sales: 3 years</li></ul><p>Required license or certification:</p><ul><li>Driver&apos;s License</li></ul>","jobApplication":"https://www.indeed.com/cmp/Feel-Good-Sales-Group/jobs/Regional-Sales-Representative-4680c60f47307bf0"},
  {"_id":"d2f1033f6270c09c","companyName":"Riderflex","jobTitle":"Sales Rep - (California / Horticulture / Cannabis 150k potential)","jobType":"Full-time","jobLocation":"Los Angeles, CA","date":"November 26, 2017","jobCompensation":"$42,000 a year","jobDescription":"<p><b>PRIOR HORTICULTURE, AGRICULTURE OR CANNABIS INDUSTRY EXPERIENCE IS REQUIRED</b></p><p><b>Riderflex</b> is a global Recruiting Firm based in Denver, CO. Our client, <b>Key To Life</b> , is a hydroponic and organic fertilizer company with customers in the Horticulture and Cannabis space that purchase their products for commercial grows.</p><p>If you&#x2019;re a <b>Wholesale Sales Professional</b> with prior <b>Agriculture / Horticulture</b> experience looking for the opportunity to join a growing company that also sells into the <b>Cannabis</b> industry, this is the role for you.</p><p>We are currently recruiting Sales Rep candidates for the following three areas: <b>Portland / Seattle, California and the New England</b> market.</p><p><b>If you have personal cannabis industry experience that is not listed or identified within a prior job on your resume, please make a note of that in your summary or cover letter when applying.</b></p><ul><li><b>Title</b> : Sales Representative (or Sales Consultant, Business Development Rep)</li><li><b>Industry</b> : Wholesale / Agriculture / Horticulture / Cannabis</li><li><b>Locations</b> : Three locations: Portland / Seattle, California, New England</li><li><b>Total Compensation</b> : Estimated between $100k and $150k, no commission cap</li><li><b>Base Salary</b> : $42k</li><li><b>Commissions</b> : 10% of revenue!</li><li><b>Type</b> : Full Time / W-2</li><li><b>Benefits</b> : Health Care, 401k</li><li><b>Travel</b> : 60% within market</li><li><b>Office</b> : Remote</li><li><b>Relocation Assistance</b> : Available for the right candidates</li></ul><p><b>RESPONSIBILITIES</b></p><ul><li><b>Selling fertilizer products to commercial grows withing the Horticulture and Cannabis industries</b></li><li>Sales and Business Development with accounts</li><li>Open new doors / accounts</li><li>Track and report on key metrics</li><li>Daily travel to meet with customers</li><li>Work with owners and upper management of commercial and independent grows</li><li>Work directly with decision makers</li><li>Present product features and benefits</li><li>Gather market intelligence and communicate these opportunities to management</li><li>Work independently and manage a territory thoroughly</li></ul><p><b>REQUIREMENTS</b></p><ul><li>3 to 5 years sales experience</li><li>Outside direct sales experience</li><li>Wholesale sales experience</li><li>Cold calling / new territory / opening new accounts experience</li><li>Prior Agriculture / Horticulture industry experience</li><li>Industry connections / deep network &#x2013; must have ability to call on current network of growers and commercial grows within agriculture, horticulture and or cannabis</li><li>Aptitude for quantitative analysis, strategic thinking, and tactical execution</li><li>Outgoing personality</li><li>Excellent verbal communication skills</li><li>Relationship Management skills</li><li>Ability to stay organized and follow up with clients</li><li>Willingness to travel up to 60% of work schedule</li></ul><p><b>PREFERRED</b></p><ul><li>Cannabis industry sales experience</li><li>Cannabis growing experience a plus</li><li>Prior experience with small to mid-sized companies a plus</li><li>High end horticulture experience &#x2013; Fruit, Flowers, Bedding Plants, Golf Courses</li><li>Prior experience with high commission structure</li><li>BA degree preferred, but not mandatory</li></ul><p><b>BENEFITS</b></p><ul><li>Health and Dental</li><li>401k</li><li>Vacation</li></ul><p>Job Type: Full-time</p><p>Required experience:</p><ul><li>Agriculture or Horticulture or Cannabis industry sales: 3 years</li></ul>","jobApplication":"https://www.indeed.com/cmp/Riderflex-Consulting-(recruiting-firm)/jobs/Sales-Representative-d2f1033f6270c09c"},
  {"_id":"83f6c7b845fc5efd","companyName":"Arcturus Light","jobTitle":"Head Grower","jobType":"Full-time","jobLocation":"Los Angeles, CA","date":"November 24, 2017","jobCompensation":"$200,000 - $300,000 a year","jobDescription":"<p>Looking for a head grower in downtown Los Angeles.</p><p>100 light facility</p><p>Job Type: Full-time</p><p>Salary: $200,000.00 to $300,000.00 /year</p>","jobApplication":"https://www.indeed.com/cmp/Arcturus-Light/jobs/Head-Grower-83f6c7b845fc5efd"},
  {"_id":"5d66754211bb71be","companyName":"Medical Co.","jobTitle":"Med Hub Key Holder","jobType":"Full-time","jobLocation":"Los Angeles, CA","date":"November 24, 2017","jobCompensation":"$15 - $18 an hour","jobDescription":"<p>We are a dynamic cannabis company leading the way in a competitive and exciting industry with limitless growth. You are a driven and self-motivated individual with ambition to build a career and showcase your abilities in an environment that fosters your creativity and entire skill-set.</p><p><b>Responsibilities of this Job: </b></p><p>&#xF0B7; Performance Management:</p><ul><li>Lead a talented team to meet or exceed assigned service and revenue objectives through development and monitoring of sales goals for location in assigned area.</li></ul><ul><li>Ensure all employees demonstrate an understanding of the company&#x2019;smission, vision, values, and products and services</li></ul><p>&#xF0B7; Operations Management:</p><ul><li>Oversee store presentation including facility management, adherence to company&apos;s directives and store standards.</li></ul><p>&#xF0B7; Customer Retention:</p><ul><li>Manage and grow existing customer base.</li></ul><ul><li>Collaborate cross-functionality with other locations to analyze issues that impact sales, and recommend,develop, and implement process improvements.</li></ul><ul><li>Ensure that customer complaints arebeing resolved in a timely and friendly manner.</li></ul><p>&#xF0B7; Market &amp; &amp; Industry Knowledge:</p><ul><li>Maintain knowledge of company and all promotional elements.</li></ul><ul><li>Remain current on all products and service, industry and competitive trends, and reinforce findings with leadership.</li></ul><p>&#xF0B7; Daily Procedure:</p><ul><li>Updating POS, maintain a clean and organized work location, refilling inventory and managing product.</li></ul><ul><li>Employee communication and employee accountability.</li></ul><ul><li>Monitoring of all orders and operational efficiency, including bags, jars and labels for optimal results; meet route management duties.</li></ul><ul><li>Validate driver expectations and bud-tending.</li></ul><ul><li>Cash verification, employee coverage and training.</li></ul><ul><li>Audit time sheets, if needed. Key-holder responsibilities.</li></ul><ul><li>Cash management and product refill responsibilities.</li></ul><p><b>Required Skills: </b></p><p>&#xF0B7; Excellent communication skills</p><p>&#xF0B7; Ability to empower and develop a customer-oriented team while delivering on results</p><p>&#xF0B7; Professionalism</p><p>&#xF0B7; Passionate about our solutions</p><p>&#xF0B7; Goal and solutions-oriented</p><p>&#xF0B7; Motivated to learn and resourceful</p><p>Job Type: Full-time</p><p>Salary: $15.00 to $18.00 /hour</p><p>Job Location:</p><ul><li>Los Angeles, CA</li></ul>","jobApplication":"https://www.indeed.com/cmp/Medical-Co./jobs/Medical-Hub-Key-Holder-5d66754211bb71be"},
  {"_id":"40a112f84db66dd3","companyName":"Brookhollow Ventures Inc.","jobTitle":"Real Estate Professional","jobLocation":"Los Angeles, CA","date":"November 21, 2017","jobDescription":"<p>We are seeking for talented Real Estate Professionals to join the Premier <b>Cannabis</b> Real Estate Firm in Southern California!</p><p><b>Responsibilities: </b></p><ul><li>Make Cold Calls &amp; Book Appointments</li><li>Property Sensitive Use Analysis</li><li>Property Market Positioning Proposals</li><li>Ownership Databasing</li></ul><p><b>Qualifications: </b></p><ul><li>Previous experience in real estate, property management, or other related fields</li><li>Minimum 1-2 years preferred</li><li>Experience with real estate contracts and leases</li><li>Please note. We are located in DTLA.</li><li>Excellent written and verbal communication skills</li><li>Bilingual preferred but not must</li></ul><p><b>Compensation: </b></p><ul><li>Commission Only</li></ul><p>Job Type: Commission</p><p>Job Location:</p><ul><li>Los Angeles, CA</li></ul><p>Required experience:</p><ul><li>Real Estate: 1 year</li></ul><p>Required language:</p><ul><li>any other language besides English</li></ul>","jobApplication":"https://www.indeed.com/cmp/Brookhollow-Ventures-Inc./jobs/Real-Estate-Professional-40a112f84db66dd3"},
  {"_id":"bc56412e06ced4a0","companyName":"DAILY GREENS","jobTitle":"Receptionist/Budtender","jobType":"ryThe word budtender is derived from the bartender, and in some ways the job is similar, but in other ways its very different. Unlike a bar, people are not ","jobLocation":"Whittier, CA 90606","date":"November 19, 2017","jobCompensation":"$10.50 - $12.00 an hour -         Full-time,Part-time","jobDescription":"<p><b>Job Summary</b></p><p>The word &#x201C;budtender&#x201D; is derived from the bartender, and in some ways the job is similar, but in other ways it&#x2019;s very different. Unlike a bar, people are not allowed to enjoy their product in the store, so although there&#x2019;s going to be some interaction with customers, it&#x2019;s going to be before the sale and without consumption. This means you have to be customer-ready and capable of being knowledgeable and sociable without smoking or eating cannabis.</p><p>Requirements of budtender jobs include:</p><p>Friendly with good customer service. Knowledge of marijuana strains and productsGood organizational skills. Clean criminal record. Trustworthiness and reliability. And, of course, any other qualifications you might bring, especially if you are thinking about moving up in our organization.</p><p>18+ needs valid state id &amp; rec</p><p>21+ needs valid state id</p><p><b>Qualifications and Skills</b></p><p>Please email 2 self portraits and a copy of a valid state id to be considered.</p><p>Job Types: Full-time, Part-time</p><p>Salary: $10.50 to $12.00 /hour</p><p>Job Location:</p><ul><li>Whittier, CA 90606</li></ul><p>Required education:</p><ul><li>High school or equivalent</li></ul>","jobApplication":"https://www.indeed.com/cmp/DAILY-GREENS/jobs/Receptionist-Budtender-bc56412e06ced4a0"},
  {"_id":"de91f494b1a58218","companyName":"Cannabis p&p","jobTitle":"Sales Rep with graphic design skills","jobType":" are Looking for a sales rep/account manager for cannabis accessories company.Office is located in Arcadia, California. Therefore, applicant must be lo","jobLocation":"Arcadia, CA","date":"November 24, 2017","jobCompensation":"$11 - $20 an hour -         Full-time,Part-time","jobDescription":"<p>Hello! We are Looking for a sales rep/account manager for cannabis accessories company.</p><p>Office is located in Arcadia, California. Therefore, applicant must be local or able to commute daily.</p><p>Requirements:</p><p>interest in the cannabis industry</p><p>sales experience</p><p>18 and over</p><p>skills preferred:</p><p>graphic design</p><p>photoshop/illustrater</p><p>photography</p><p>please send social media, portfolio and resume to email. Thank you!</p><p>Job Types: Full-time, Part-time</p><p>Salary: $11.00 to $20.00 /hour</p>","jobApplication":"https://www.indeed.com/cmp/Plug-and-play/jobs/Sales-Representative-Graphic-Design-Skill-de91f494b1a58218"},
  {"_id":"aeaa04aef9549afd","companyName":"Cura CS LLC","jobTitle":"Senior Account Executive","jobType":"Full-time","jobLocation":"Burbank, CA","date":"November 20, 2017","jobDescription":"<p>As a Senior Account Executive you will be the sales point of contact at one of the top cannabis oil companies in the country. Cura is the leading oil producer in the state of Oregon with operations quickly expanding into California and Nevada. A successful Senior Account Executive, will be one that enjoys wearing multiple hats. This means, you could be opening new territories, building stronger relationships with managers/buyers, and managing demo teams, all while achieving your personal and sales-team&#x2019;s goals. Working well with others in team environments and on your own in the field will be major keys to success at Cura. This position is best suited for &#x201C;go-getters&#x201D;, who thrive in startup environments.</p><p><b>A successful candidate will have these three primary deliverables</b></p><ul><li><b>Be passionate</b> about the cannabis industry and Cura&#x2019;s &#x201C; <b>Everything is Possible</b> &#x201D; culture. That is at the heart of <b>Who We Are</b> , and every team member must feel the same sense of <b>ownership</b> , <b>innovation</b> , and <b>hustle</b> as we shape the industry across the U.S and around the world.</li><li><b>Grow sales</b> : build your client list, expand and empower your team, show sales growth each month.</li><li><b>Obsess over improving and simplifying things</b> : improve sales processes, utilize sales tools and technology, streamline communication, and set up actions that can be measured.</li></ul><p><b>A Senior Account Executive is responsible for the following</b></p><ul><li>Represent Cura&#x2019;s brand and products in a professional and educated manner.</li><li>Establish and maintain relationships with dispensary owners, intake managers, buyers, and budtenders.</li><li>Maintain all account&#x2019;s sales, customers, leads and valuable information in CRM and Accounting software.</li><li>Provide irreplaceable customer service to your accounts.</li><li>Plan, strategize and execute ways to achieve company and individual sales goals.</li><li>Utilize technology to generate new leads via Google, Weedmaps, Leafly, and other online platforms.</li><li>Coordinate and conduct vendor demo days within your territory.</li><li>Effectively meet your account&#x2019;s needs: product and customer service.</li><li>Thoroughly count, handle and deliver cash and checks.</li><li>Stay up-to-date with current in the cannabis industry, state&apos;s marijuana compliance, and market trends.</li><li>Communicate clearly the progress of monthly and quarterly sales goals to your manager and on KPI reports.</li><li>In addition to the listed responsibilities, there may have specific responsibilities or tasks required by manager.</li></ul><p><b>Requirements</b></p><ul><li>Bachelor&#x2019;s Degree.</li><li>1+ year experience in the cannabis industry.</li><li>5+ years of Account Management and sales.</li><li>Must love a fast-paced environment, with the ability to be flexible and adaptable in the workplace. In-depth knowledge of the cannabis industry.</li><li>Strong people skills with an outgoing friendly personality.</li><li>Effective time management, organization, and strong multitasking skills.</li><li>Ambitious, curious and strong passion for learning about Select products and company history.</li><li>Strong communication, writing skills, and analytic sales thinking.</li></ul><p><b>Preferred</b></p><ul><li><b>Proficient in Word, Excel, Outlook and all Google Suite programs.*</b></li><li>Experienced with Salesforce, or similar CRM/Lead management systems.*</li></ul><p><b>Compensation</b></p><p>Based on experience.</p><p>Job Type: Full-time</p>","jobApplication":"https://www.indeed.com/cmp/Cura-CS-LLC/jobs/Senior-Account-Executive-aeaa04aef9549afd"},
  {"_id":"404e2795e5e2fd2a","companyName":"Cura CS LLC","jobTitle":"Business Operations Team Member","jobType":"Full-time","jobLocation":"Burbank, CA","date":"November 13, 2017","jobCompensation":"Full-time,Commission","jobDescription":"<p>The Business Operations Team Member will be responsible for supporting both the office and field sides due to the large amount of overlap in responsibility. On both sides of this role, the Business Operations Team Member will need to be aware that they must possess the ability to work well on a team as well as be self-motivated and accomplish tasks accurately and quickly in an independent manner. These individuals must be able to multi-task, work quickly and efficiently, and be adaptable to change priorities and tasks as needed. We have a very fast- paced environment as we continue to grow and expand. Must be motivated, trustworthy, and a team player.</p><p>This position is hourly, with the pay rate depending on experience. It is not a management or commission sales position.</p><p>RESPONSIBILITIES:</p><p><b>OFFICE</b></p><p><i>Strong Inventory Management Skills: </i></p><ul><li>Responsible for handling state-monitored inventory tracking system in a way that reflects company standard operating procedures.</li><li>Responsible for processing inventory based on company and government standards to generate saleable product and fulfill orders in a timely manner.</li><li>Responsible for quickly and accurately updating team members through use of various software applications and technologies to ensure product is sold in a compliant manner which meets the needs of both clients and sales representatives.</li><li>Responsible for caring for product in a manner which reflects company standards as it relates to proper storage and transportation.</li></ul><p><i>Strong Communication Skills: </i></p><ul><li>Responsible for clearly and concisely transmitting information between team members, sales representatives, production crew and/or clients when performing functions related to all of the above inventory management responsibilities.</li><li>Business Ops Member must function with an awareness of how much of the information related to performing job functions is somewhat sensitive and should not be freely discussed.</li><li>Business Ops Member must be available to follow up on work performed during at any given time to rectify issues as they arise.</li><li>Business Ops Member must possess technology and skills related to said technology to achieve positive and timely communication to provide essential information.</li></ul><p><i>Order Fulfillment: </i></p><ul><li>Business Ops Member should expect to be able to pick up and push heavy objects as well as work under fast-paced and stressful conditions for fairly long periods of time.</li><li>Business Ops Member must take ownership of work and immediately communicate essential information to rectify mistakes.</li><li>Almost every aspect of the job is somewhat time sensitive and all functions require Business Ops Member to keep an awareness of what times of day serve as windows to perform essential job functions while other times of day are closed off to these opportunities - as they relate to operating hours of clients, state-mandated time windows, etc.</li></ul><p><b>FIELD SIDE</b></p><p><i>Driving Skills</i></p><ul><li>Business Ops Member is responsible for accurately recording and taking ownership of the duties performed and when delivering on company time.</li><li>Business Ops Member must display a sensitivity towards correlation between company reputation and employee conduct. The way we drive will reflect in the success of our ability to compliantly delivering product in a timely manner.</li><li>Business Ops Member is responsible for possessing the ability to drive in a safe, time sensitive and consistent manner that reflects respect for company policies and customer expectation.</li></ul><p><i>Customer Service: </i></p><ul><li>Personally responsible for substantiating activities when performing deliveries for the sake of harvesting customer feedback, market data as well as rectifying any complications related to performing essential job functions.</li><li>Will be responsible for presenting oneself in a clean, respectful, responsible, confident, and professional manner. Business Ops Member are delivering on behalf of account managers and this should be reflected in the way they conduct themselves when interacting with clients.</li><li>Must maintain an awareness of laws and regulations to support client, but must also conduct themselves and behave in a manner which demonstrates Cura&#x2019;s willingness to assist the client in any way they feel they need to be.</li></ul><p><i>Time Management</i></p><ul><li>Responsible for diligently recording data related to deliveries and following planned routes very closely and in the timely manner to meet state requirements.</li><li>Must show consistent and adequate preparedness in resolving customer issues or conducting deliveries, especially on long routes, so that they can be performed in a compliant manner that reflects sales representative and customer needs.</li><li>Will be responsible for having a somewhat flexible schedule to meet the needs of long distance delivery routes or other client/rep needs.</li><li>Following all state, local, and company rules and ensure conformance to all law.</li><li>Good driving record and valid driver&#x2019;s license</li><li>Taking instructions from supervisors</li></ul><p>job qualifications</p><ul><li>3+ years&#x2019; outside sales experience</li><li>Bachelor&#x2019;s degree preferred</li><li>Must be willing to travel</li><li>QuickBooks experience</li><li>Comfortable using computer and sales software</li><li>Self-motivated and comfortable working with little to no direction</li><li>Excellent interpersonal communication skills</li><li>Knowledge of the Cannabis industry preferred</li></ul><p>compensation</p><p>Compensation depends on experience. Full time Cura employees are eligible for Medical, Dental and Vision benefits after 60 days of employment.</p><p>Job Type: Full-time</p>","jobApplication":"https://www.indeed.com/cmp/Cura-CS-LLC/jobs/Business-Operation-Team-Member-404e2795e5e2fd2a"},
  {"_id":"e3ea1f37b3991111","companyName":"Green 4 Good, Inc","jobTitle":"Social Media Intern","jobLocation":"Santa Monica, CA 90405","date":"November 17, 2017","jobDescription":"<p><b>Social Media Intern</b></p><p>The Social Media Intern is responsible for coordinating and executing the company&#x2019;s social media strategy, working across key social media channels including Instagram, YouTube, Facebook, Twitter and LinkedIn. This role offers the intern a total immersion into a busy socially conscious cannabis company and the successful candidate will work closely with key members of staff, external social media consultants, and the company&#x2019;s clients to learn about social media, digital communications and marketing in a business to business environment. This role will be instrumental in increasing our social media presence and gaining visibility for our brand among clients.</p><p><b>SM Key Duties: </b> Social Media Community Management</p><ul><li>Assist with streamlining company social media accounts (e.g. IG, Facebook, Twitter, LinkedIn, YouTube, and other social media platforms), ensuring uniform content and tone of voice for landing pages, graphics, and other elements within the communities.</li><li>Increase the number of followers we have on various platforms by following and engaging with potential clients and supporters.</li><li>Monitoring and replying to Tweets from supporters and clients (initially under supervision)</li><li>Posting content daily (both job- and industry-related); and using tools like Hoot Suite to plan forward-looking content over weekends and holidays (under supervision)</li><li>Posting updates to the Company LinkedIn account (initially under supervision)</li><li>Use LinkedIn polls and surveys to build our social media footprint and reputation.</li><li>Help coordinate a guest blogger program, one guest blogger per month. Help to amplify this content through other social media channels.</li><li>Drive awareness of our new blog posts by posting the articles into forums and groups</li><li>Help to create one piece of video content per month and post</li><li>Upload and manage company blog posts in WordPress (initially under supervision)</li><li>Track key social media analytics monthly, including Google Analytics Use Google Reader to follow the blogs and content of our competitors and key clients. Work with each team to create and send one email broadcast per month around content ideas and keys jobs.</li><li>Research free online directories to generate inbound links for SEO.</li><li>Using Google, search on key words and look at our competitors&#x2019; brands for forums and directories that we can sign up to generate in-bound links for our company.</li></ul><p><b>SM Required Skills</b></p><ul><li>Excellent verbal communications skills.</li><li>An interest in marketing, communications, social media or reputation management;</li><li>Familiarity with key social media tools (e.g. Instagram, Twitter and Facebook) and with Microsoft Office products (e.g. Word, PowerPoint, Excel)</li><li>An ability to consistently demonstrate our values of insight, hard work, and effectiveness in your personal approach to work</li><li>An entrepreneurial attitude</li><li>Excellent attention to detail and a high motivation to learn</li><li>A proactive, service-focused attitude towards investors, clients, supporters and the teams you support internally</li><li>An ability to remain calm under pressure and a robust/resilient attitude towards challenges</li><li>An ability to prioritize work and complete tasks with quick turnaround times</li><li>The ability to work collaboratively with a team.</li></ul><p>Job Type: Internship</p><p>Required experience:</p><ul><li>Social: 3 years</li></ul>","jobApplication":"https://www.indeed.com/cmp/Green-4-Good,-Inc/jobs/Social-Media-Intern-e3ea1f37b3991111"},
  {"_id":"0ec6dd8dbbe7fcad","companyName":"AMG Collective & Green Cross","jobTitle":"Now Staffing Guards, Customer Sales Postitions","jobType":"Full-time","jobLocation":"Los Angeles, CA","date":"November 13, 2017","jobCompensation":"$11 - $15 an hour","jobDescription":"<p><b>Job Summary</b></p><p>We are Los Angeles pre-ICO, legally compliant medical cannabis collectives now hiring all positions to prepare for 2018 recreational market. We are seeking experienced, hard-working, honest and awesome individuals for all positions:</p><p>*Armed Guards</p><p>*UnArmed Guards</p><p>*Patient Consultants</p><p>We provide lots of benefits, pay raises, travel bonus, &amp; more - 2 locations hiring currently.</p><p>Please send resume with job experience, availability and current contact information.</p><p>Job Type: Full-time</p><p>Salary: $11.00 to $15.00 /hour</p><p>Required experience:</p><ul><li>guard: 1 year</li></ul><p>Required licenses or certifications:</p><ul><li>CA Medical Cannabis Recommendation</li><li>BSIS Guard Card</li></ul>","jobApplication":"https://www.indeed.com/cmp/Cruz-Verda/jobs/Staffing-Guard-0ec6dd8dbbe7fcad"},
  {"_id":"f94c22556ef1d170","companyName":"JB Clothing","jobTitle":"Customer Service & Warehouse Manager","jobType":"Full-time","jobLocation":"Los Angeles, CA","date":"November 13, 2017","jobDescription":"<p><b>Job Summary</b></p><p>Fast-growing cannabis-based streetwear apparel company seeks Customer Service and Warehouse Manager to join the team.</p><p>This is a full-time job that requires high attention to detail, the ability to manage several projects at once, and an understanding of the e-commerce and retail environment. The person in this role will work roughly 40 hours per week, including the occasional late night and some weekend events. <b>This position is temporary for the first 60 days. Upon successful completion of 60 days the position becomes a permanent addition to staff.</b></p><p><b>Essential Roles &amp; Responsibilities: </b></p><p><b>Customer Service</b></p><ul><li>Assure that all customer orders are shipped in a timely manner;</li></ul><ul><li>Manage high volume of communications with customers, sales representatives and wholesale accounts</li></ul><ul><li>Process all ecommerce returns, and exchanges</li></ul><p><b>Order Fulfillment</b></p><ul><li>Manage order processing flow and participate in fraud prevention efforts</li></ul><ul><li>Identify and communicate any possible improvements to be made in the fulfillment process</li></ul><ul><li>Assist the fulfillment team with orders as needed</li></ul><p><b>Inventory Management</b></p><ul><li>Assist with various marketplaces, including our e-commerce site and pop-up shop</li></ul><ul><li>Work closely with the Creative Director and team to coordinate and facilitate new collection releases</li></ul><ul><li>Create and implement successful inventory management practices</li></ul><p><b>Warehouse/Office Administration</b></p><ul><li>Monitor all materials necessary for shipping/fulfilling orders, keeping supplies stocked at all times.</li></ul><ul><li>Establish efficient storage systems for warehouse and fulfillment area</li></ul><p>As the Customer Service and Warehouse Manager, your role is to manage the fulfillment team, providing support, direction and physical assistance when necessary. This may include printing barcodes, barcoding products and conducting quality assistance checks, in addition to the packing, moving and shipping of orders.</p><p>If you love a dynamic, high-energy work environment that is a little different every day, then this is the company for you.</p><p>Job Type: Full-time</p><p>Job Location:</p><ul><li>Los Angeles, CA</li></ul><p>Required experience:</p><ul><li>Customer Service: 3 years</li></ul>","jobApplication":"https://www.indeed.com/cmp/Jungle-Boys-Clothing/jobs/Customer-Service-Warehouse-Manager-f94c22556ef1d170"},
  {"_id":"cd12d41a05827bbc","companyName":"Green 4 Good, Inc","jobTitle":"Data and Research Intern","jobLocation":"Santa Monica, CA 90405","date":"November 17, 2017","jobDescription":"<p><b>Data and Research Intern</b></p><p>This role will support departments of the socially conscious cannabis company including Social Media, Creative and Tech operations to develop robust statistical and machine learning models to better understand campaign performance, user behavior, and optimizations; evaluate and quantify the impact of partner performance; and provide insights on immediate and long-term campaign decisions.</p><p>The ideal candidate is a self-starter who is passionate about data and analytics.</p><p><b>Key Duties: </b></p><ul><li>Visualize small-to-large data sets using graphs, charts and more</li><li>Provide analysis and insights to fuel decision making and other processes</li><li>Describe data using statistics and data visualization tools/techniques</li><li>Balance detail oriented research with goal oriented business objectives</li><li>Tracking, validating, logging and organizing client campaign data</li><li>Generating clear, compelling and actionable insights from data sets</li><li>Assist in providing insights for campaign initiatives; provide relevant data to support campaigns</li></ul><p><b>Required skills: </b></p><ul><li>Current community college/undergrad/grad student pursuing a career in Marketing, Business, Computer Science, or other applicable field of study</li><li>Solid foundation in Analytics / Mathematics &amp; Statistics</li><li>Ability to think critically and interrogate results</li><li>Expert in MS Excel (knowledge in SQL and other languages is a plus)</li><li>Proficiency formatting data, creating charts and visualizations</li><li>Highly organized and superior attention to detail</li><li>Excellent research abilities</li><li>Ability to thrive in a fast-paced environment</li></ul><p>Must be legally authorized to work in the United States</p><p>Job Type: Internship</p><p>Job Location:</p><ul><li>Santa Monica, CA 90405</li></ul><p>Required education:</p><ul><li>Bachelor&apos;s</li></ul><p>Required experience:</p><ul><li>Business Analysis: 3 years</li></ul>","jobApplication":"https://www.indeed.com/cmp/Green-4-Good,-Inc/jobs/Data-Research-Intern-cd12d41a05827bbc"},
  {"_id":"add6730fb4890038","companyName":"Vangst","jobTitle":"Dispensary Manager","jobType":"Full-time","jobLocation":"Los Angeles, CA","date":"November 15, 2017","jobDescription":"<p>Our client is currently looking to hire an experienced Dispensary Manager to join their cannabis dispensary group in Coachella Valley. This individual should have experience running cannabis retail operations as well as experience outside of the industry. Please include an up to date resume and cover letter to apply.</p><p>Responsibilities</p><ul><li>Work with executive team to help with the design and build out of dispensary</li><li>Develop and implement operational rules, regulations, policies, and procedures</li><li>Create all dispensary SOPs</li><li>Develop and execute a hiring plan for dispensary</li><li>Manage, supervise and direct the activities of the dispensary team</li><li>Oversee and manage quality product inventory and financial records</li><li>Ensure the dispensary&#x2019;s compliance with security, inventory and local and state regulations</li><li>Manage financial records and cash handling procedures</li><li>Manage and inspire internal staff to deliver the highest level of customer experience</li><li>Ensure the safety and satisfaction of both the patients and employees</li><li>Provide education for staff about medical cannabis strains, edibles, concentrates and consumption mechanisms</li><li>Work with Executive Team to create budgets and forecast sales</li><li>Set sales, service, and profit goals and lead staff to exceed them</li><li>Work with wholesalers to negotiate and procure an adequate supply of quality products</li><li>Oversee employee scheduling</li><li>Serve as a liaison to the local community</li><li>Maintain in-depth knowledge of products and strains in the store, as well as industry-wide product knowledge</li><li>Review performance of other dispensary employees on a regular basis</li><li>Oversee all hiring, discipline, termination or advancement of employees</li></ul><p>Requirements</p><ul><li>4+ years of experience managing a cannabis dispensary in a compliant state</li><li>Prior experience managing retail locations</li><li>Possess valid driver&#x2019;s license or state ID</li><li>Pass background check</li></ul><p>Job Type: Full-time</p><p>Required experience:</p><ul><li>dispensary management: 3 years</li><li>retail management: 3 years</li><li>SOP implementation: 3 years</li><li>professional cannabis industry: 4 years</li></ul>","jobApplication":"https://www.indeed.com/cmp/Gradujuana/jobs/Dispensary-Manager-add6730fb4890038"},
  {"_id":"ec7e024c313bd50d","companyName":"GreenSTOP LLC","jobTitle":"Vice President of Engineering","jobType":"Full-time","jobLocation":"Los Angeles, CA","date":"November 19, 2017","jobCompensation":"$150,000 a year","jobDescription":"<p><b>Job Summary</b></p><p><b>GreenSTOP LLC. Vice President of Engineering</b></p><p>Location: In office &amp; Remote</p><p>City and State: Los Angeles, Ca</p><p>Hours: Full Time</p><p>Degree(s): Mechanical Engineering, Electrical Engineering, Robotics, Mechatronics, Computer Science</p><p>Valid Work Authorization: Yes. U.S. citizenship or work visa</p><p><b>Salary and Benefits: </b></p><ul><li>Base Salary: $150,000</li><li>Performance Bonus: 10%-50%</li><li>Stock options: varying</li><li>Health</li><li>Dental</li><li>Vision</li><li>401 k</li><li>Paid vacation</li><li>Life insurance</li></ul><p><b>Description: </b></p><p>At GreenSTOP, our employees have incredible opportunities to work on revolutionary systems in robotics, artificial intelligence and automated systems that impact people&#x2019;s lives around the world today, and for generations to come. We look for people who have bold new ideas, courage and a pioneering spirit to join forces to invent the future, and have a lot of fun along the way. Our culture thrives on intellectual curiosity, cognitive diversity and bringing your whole self to work &#x2014; and we have an insatiable drive to do what others think is impossible. Our employees are not only part of history, they&#x2019;re making history.</p><p>GreenSTOP LLC is a revolutionary technology company in the world&apos;s fastest emerging market. GreenSTOP&apos;s patented technology will disrupt an entire industry. Our organization is looking for a passionate VP of Engineering to join our elite team. Our team is made up of some of the most talented engineers and designers in the industry. Our GreenSTOP VP of Engineering, with management responsibility, will assist in commercialization of smart machines. This opportunity offers stock options and an experience that will be priceless. Our team is working with celebrities and elite investors. At GreenSTOP LLC we provide a culture of teamwork, entrepreneurship, leadership, research/development, vision, confidence, and strategy.</p><p>Our GreenSTOP VP of Engineering will get the opportunity to join an elite team that has what it takes to change the world with technology and innovation. In addition, this position will be a part of the exciting journey of Venture Capital, which will be featured on our upcoming reality show about GreenSTOP called Venture Cannabis. Venture Cannabis is currently being shopped to some of the largest networks on the planet. GreenSTOP&apos;s mission is to deliver an expedited, user-friendly service for customers to purchase high quality products at economical prices. GreenSTOP will bring accountability, improved health/safety standards, solutions to government concerns, amazing customer service/experience, and a next generation approach to an industry with great opportunities for technological innovations.</p><p><b>RESPONSIBILITIES SUMMARY</b></p><p>The Vice President of Product Engineering is responsible for providing leadership in planning, establishing and directing all aspects of the company&#x2019;s engineering policies, objectives and initiatives based on product and profitability goals. Responsible for supplying and maintaining adequate resources for all Product Engineering (Engineering) functions in the pursuit of the company&#x2019;s strategic goals and operational plans.</p><p>Duties and responsibilities include the following:</p><ul><li>Establishes current and long range objectives, plans, and policies, subject to approval by the CEO.</li><li>Partners with the Chief Technology Officer and Engineering Technology staff to foster one organizational approach for Product Engineering and Engineering Technology.</li><li>Directly supervises employees in a Product Engineering Department. Carries out supervisory responsibilities in accordance with the organization&apos;s policies and applicable laws. Responsibilities include interviewing, hiring, training and developing employees; planning, assigning, and directing work; appraising performance; rewarding and disciplining employees; addressing complaints and resolving problems.</li><li>Develops or reviews Product Engineering budgets and resource allocation to ascertain project time frame and funding limitations, and to determine methods and procedures for accomplishment of programs and projects in accordance with allotment of funds to various phases of project.</li><li>Responsible for strategic planning, budgets and control of project expenditures.</li><li>Creates a technical vision and technology roadmap for the company and plans for implementation of new technical projects or product lines.</li><li>Dispenses advice, guidance, direction, and authorization to carry out major plans and procedures, consistent with established policies and corporate approval.</li><li>Performs detailed and continuing analysis of product offerings as compared to competition.</li><li>Provides technical advice to assist in solving problems and continuous process and product improvement.</li><li>Develops a climate within the department to foster a high level of employee motivation, performance, and commitment. Develops staffing plan and reviews work plan and schedules for each phase of a project in accordance with time limitations and funding.</li><li>Works with other departments to ensure completion of programs on time and within budget.</li><li>Represents organization with major customers and the public.</li></ul><p><b>SUPERVISORY RESPONSIBILITIES</b></p><p>Carries out supervisory responsibilities in accordance with the organization&apos;s policies and applicable laws.</p><p>Qualifications</p><p><b>SKILLS AND ABILITIES</b></p><ul><li>Ability to effectively present information and respond to questions from groups of managers, customers, particularly with all customers, suppliers, and the general public. Superior communication skills and can present his/her ideas in a clear, concise manner; one who can adapt his/her communication style as needed.</li><li>Ability to apply principles of logical or scientific thinking to a wide range of intellectual and practical problems.</li><li>Ability to define problems, collect data, establish facts, and draw valid conclusions. Ability to interpret an extensive variety of technical instructions in mathematical or diagram form and deal with several abstract and concrete variables.</li><li>Develop and implement strategic initiatives and solutions.</li><li>Lead, direct, and control development projects to include planning, defining requirements and budget, systems design, programming, and controls, analysis testing.</li><li>Demonstrated strong leadership, collaboration, project management, problem-solving, change management and influencing skills.</li><li>Comfortable and well-practiced leading teams.</li><li>Experience serving as a technical advisor to a senior leadership team.</li><li>Unquestioned integrity.</li><li>Consensus builder with strong persuasion skills.</li><li>A highly motivated team player.</li><li>A good listener.</li><li>Must be flexible with the ability to change, adapt and grow.</li></ul><p><b>EDUCATION and/or EXPERIENCE</b></p><ul><li>Bachelor&#x2019;s Degree in Engineering or another technical discipline. Master&#x2019;s level degree in a scientific or MBA a plus.</li><li>Mechatronics Engineering experience required.</li><li>Minimum of 15 years of related experience in senior level engineering leadership.</li><li>Assignments require considerable knowledge of management practice and policy interpretation or some combination of education and experience that would enable senior technical capability allowing the incumbent to independently evaluate, select, and apply techniques and standards.</li><li>Strategic planning and budgeting experience.</li><li>This job description in no way states or implies that these are the only duties to be performed by the employee(s) incumbent in this position. Employee(s) will be required to follow any other job-related instructions and to perform any other job-related duties requested by any person authorized to give instructions or assignments.</li></ul><p><b>WORK ENVIRONMENT/PHYSICAL DEMANDS</b></p><p>The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.</p><ul><li>Work performed in an office and factory settings.</li><li>Exposure to shop environment such as noise, dust, odors and fumes.</li><li>Occasionally required to lift up to 20 lbs.</li><li>Regularly required to sit, stand, bend, reach and move about facilities.</li></ul><p>Job Type: Full-time</p><p>Salary: $150,000.00 /year</p><p>Job Location:</p><ul><li>Los Angeles, CA</li></ul><p>Required education:</p><ul><li>Master&apos;s</li></ul><p>Required experience:</p><ul><li>Hardware Development: 10 years</li><li>Engineering: 10 years</li></ul>","jobApplication":"https://www.indeed.com/cmp/GreenSTOP-LLC/jobs/Vice-President-Engineering-ec7e024c313bd50d"},
  {"_id":"56ffecdc8bad5db6","companyName":"Kushie Brand","jobTitle":"Labeling and Packaging","jobType":"Full-time","jobLocation":"Los Angeles, CA","date":"November 9, 2017","jobCompensation":"$12 - $15/hr","jobDescription":"<p>We are a fast growing marijuana brand, and are expanding our sales team and warehouse capacity to help get legal medical marijuana products into dispensaries and delivery retailers.</p><p>We are one of the very few businesses in California that completely follow all State and Federal laws, running as a compliant operation under the cannabis laws in California. As retailer under the new requirements created in the Medical Marijuana Regulation and Safety Act, we are building a business to help the State uphold the new distribution model, and are excited about the incredible opportunity it presents.</p><p>Essential Duties and Responsibilities:</p><ul><li>Labeling and Packaging.</li></ul><p>The candidate must be able to demonstrate the following:</p><ul><li>University degree preferred; High school diploma or general education degree (GED) required.</li></ul><p>If you are interested, please send us an email back with the following information:</p><ul><li>Your first and last name</li><li>Your phone number and email address</li><li>A copy of your resume or a brief introduction of you and your work history.</li></ul><p>We offer a great work environment, flexible schedule, a really enjoyable position, and a strong compensation plan. Thank you for your interest and we looking forward to hearing from you!</p><p>Kushie Team</p><p>https://kushiebrand.com/</p><p>https://weedmaps.com/brands/kushie-brand/about</p><p><i>We aim to be the premier cannabis brand providing premium products ranging from apparel to edibles &amp; accessories.</i></p><p>Job Type: Part-time</p><p>Salary: $12.00 to $15.00 /hour</p><p>Job Types: Full-time, Part-time, Temporary</p><p>Required education:</p><ul><li>High school or equivalent</li></ul><p>Required license or certification:</p><ul><li>Regular</li></ul>","jobApplication":"https://www.indeed.com/cmp/Kushie-Brand/jobs/Labeling-Packaging-56ffecdc8bad5db6"},
  {"_id":"0b4ea553b2483c01","companyName":"Kushie Brand","jobTitle":"Outside Sales Rep","jobType":"Full-time","jobLocation":"Los Angeles, CA","date":"November 9, 2017","jobDescription":"<p>We are a fast growing marijuana brand, and are expanding our sales team to help get legal medical marijuana products into dispensaries and delivery retailers.</p><p>If you have experience in field sales and want to enter an industry with unparalleled opportunity where you can also help people, then this could be a great opportunity for you.</p><p>We are one of the very few businesses in California that completely follow all State and Federal laws, running as a compliant operation under the cannabis laws in California. As retailer under the new requirements created in the Medical Marijuana Regulation and Safety Act, we are building a business to help the State uphold the new distribution model, and are excited about the incredible opportunity it presents.</p><p>Essential Duties and Responsibilities:</p><ul><li>Generate sales with cannabis retailers.</li><li>Communicate effectively with retailer personnel regarding products, sales activities, promotions, and client / sales plan objectives.</li><li>Use a mobile system to accurately record details of your sales visits and orders.</li><li>Be dedicated to providing excellent customer service and to develop a professional working relationship with dispensary management and associates to effectively meet company objectives.</li></ul><p>The candidate must be able to demonstrate the following:</p><ul><li>Successful Sales Experience: Prior Pharma Sales Experience is a Plus.</li><li>University degree preferred; High school diploma or general education degree (GED) required.</li><li>Computer Skills: Proficient use of (and must own) a personal computer, mobile smart phone, printer and be familiar with Adobe, Word, Excel, and Google Docs/Apps.</li></ul><p>You must have (or be willing to get):</p><ul><li>A valid and current doctors recommendation to be a current MMJ patient (California law requires you to be a patient to be able to possess and transport marijuana)</li><li>A valid and current California driver&#x2019;s license</li><li>Reliable transportation</li><li>A good driving record</li></ul><p>If you are interested, please send us an email back with the following information:</p><ul><li>Your first and last name</li><li>Your phone number and email address</li><li>A copy of your resume or a brief introduction of you and your work history.</li></ul><p>We offer a great work environment, flexible schedule, a really enjoyable position, and a strong compensation plan. Thank you for your interest and we looking forward to hearing from you!</p><p>Kushie Team</p><p>https://kushiebrand.com/</p><p>https://weedmaps.com/brands/kushie-brand/about</p><p><i>We aim to be the premier cannabis brand providing premium products ranging from apparel to edibles &amp; accessories.</i></p><p>Job Types: Full-time, Part-time, Commission</p><p>Required education:</p><ul><li>High school or equivalent</li></ul><p>Required experience:</p><ul><li>Sales: 1 year</li></ul><p>Required license or certification:</p><ul><li>Regular</li></ul>","jobApplication":"https://www.indeed.com/cmp/Kushie-Brand/jobs/Outside-Sales-Representative-Cannabis-Marijuana-Industry-0b4ea553b2483c01"},
  {"_id":"00d97a65315b8d04","companyName":"Green Wise Consulting","jobTitle":"State and Local Application Writer","jobType":"Full-time","jobLocation":"Los Angeles, CA","date":"November 8, 2017","jobDescription":"<p><b>Job Summary</b></p><p>The Application Writer is primarily responsible for supporting the organization&#x2019;s State Application Process (for Cannabis) by creating, editing, and designing documentation, company policies and procedures, guides, handbooks and other documents to support the efficient and compliant operations of GWC&apos;s clients. The Technical Writer reports to the Application Project Manager who manages all Application Processes.</p><p><b>Responsibilities and Duties</b></p><p>-Available to work over the holiday</p><p>-Heavy drafting experience</p><p>-Legal background</p><p>-Ability to read, research and submit a write up on ordinances</p><p>-Quick learner</p><p>-Ability to work under tight deadlines and high pressure</p><p>- <b>Will need to submit a writing sample if resume is approved. We will provide the prompt and guidelines.</b></p><p>Job Type: Full-time</p>","jobApplication":"https://www.indeed.com/cmp/Green-Wise-Consulting/jobs/State-Local-Application-Writer-Cannabis-00d97a65315b8d04"},
  {"_id":"d84149abe81e9fb3","companyName":"Advanced Nutrients","jobTitle":"North American Human Resources Manager","jobType":"Full-time","jobLocation":"Los Angeles, CA","date":"November 12, 2017","jobDescription":"<p><b>North American Human Resources Manager</b> &#x2013; Industry Leader, Socially Conscious, Global Hydroponics Company</p><p>Would you like to be part of a globally recognized team making a difference in the world, while working in an innovative, inspiring and supportive environment?</p><p><b>THE COMPANY: </b></p><p>A globally recognized company that manufactures and supplies the most innovative and creative nutrients, supplements and additives on the market today that specifically target the cannabis plant. With our products selling in over 95 countries around the world, we are the industry leader. No other hydroponics company has created more industry &quot;firsts&quot; for the growing community... and we are just getting started!</p><p><b>THE POSITION: </b></p><p>We are looking for an experienced, full-time, permanent Human Resources Manager, for our North American operations, who will:</p><ul><li>Conduct job analyses (determine the nature of each team member&#x2019;s job) for our North American operations.</li><li>Plan employment needs and recruit job candidates.</li><li>Screen and assist in selecting job candidates for various North American locations.</li><li>Develop and implement a consistent and exciting orientation and on-boarding program for new team members.</li><li>Manage wages and salaries (compensation).</li><li>Provide incentives and benefits.</li><li>Communicate (interview, counsel, discipline).</li><li>Develop policies and procedures, and ensure compliance.</li><li>Oversee Occupational Health and Safety Committee and ensure the required standards are met.</li><li>Develop and implement various training and educational programs</li><li>Train team members and develop managers.</li><li>Build team member commitment and help shape the company culture.</li></ul><p>Salary is commensurate with experience. We offer medical, dental, 401k, and the opportunity to always be learning!!</p><p><b>THE LOCATION: </b></p><p>You will be based at our modern, new Los Angeles office, located in the heart of West Hollywood!</p><p><b>WHO SHOULD APPLY?</b></p><ul><li>You have 5 or more years&#x2019; experience as a Human Resources Manager.</li><li>You have experience managing Human Resources for a nationally and/or internationally.</li><li>Hold a degree and/or certification in Human Resource Management.</li><li>You have a comprehensive understanding of local, state, and federal employment laws.</li><li>Demonstrated ability to improve employee morale and company culture.</li><li>Are an exceptional communicator and relationship builder.</li><li>You aspire to greatness and are driven toward mastery.</li><li>You are accountable and responsible.</li><li>You take initiative and communicate openly and effectively.</li><li>You are confident and assertive.</li><li>You are able to travel, both domestic and international, on occasion and have valid passport.</li></ul><p>Job Type: Full-time</p>","jobApplication":"https://www.indeed.com/cmp/Advanced-Nutrients/jobs/North-American-Human-Resource-Manager-d84149abe81e9fb3"},
  {"_id":"67e9091286d8d979","companyName":"DAILY GREENS","jobTitle":"Receptionist/Sales Associate","jobType":"Full-time","jobLocation":"Whittier, CA 90606","date":"November 11, 2017","jobCompensation":"$10.50 - $12.00/hr","jobDescription":"<p><b>Job Summary</b></p><p>A budtender is the friendly canna-whiz behind the marijuana dispensary counter who guides medical patients and adult customers through the process of understanding, selecting and purchasing cannabis products, such as flower, concentrates, edibles and topicals.</p><p>Job Types: Full-time, Part-time</p><p>Salary: $10.50 to $12.00 /hour</p><p>Job Location:</p><ul><li>Whittier, CA 90606</li></ul><p>Required education:</p><ul><li>High school or equivalent</li></ul><p>Required experience:</p><ul><li>customer: 1 year</li></ul><p>Required travel:</p><ul><li>25%</li></ul>","jobApplication":"https://www.indeed.com/cmp/DAILY-GREENS/jobs/Receptionist-Sales-Associate-67e9091286d8d979"},
  {"_id":"af44243165f69183","companyName":"Vicente Sederberg, LLC","jobTitle":"Associate Attorney","jobType":"Full-time","jobLocation":"Los Angeles, CA","date":"November 10, 2017","jobDescription":"<p><b>Summary: </b></p><p>Vicente Sederberg is the Marijuana Law Firm - Shaping the Laws, Connecting the Players and Building an Industry. The attorneys specialize in marijuana law and policy development and share expertise with all stakeholders in this new, ever-changing regulatory environment. They advise businesses in new opportunities, state applications, licenses, corporate formation &amp; restructuring, employment contracts, mergers, acquisitions, joint ventures, commercial real estate, dispute resolution, with a specialization in compliance. For businesses and individuals, they offer criminal, civil and administrative representation. The firm serves local, state, federal and foreign governments in drafting legislation and regulations.</p><p>Associate Attorneys that have experience in California who want to be a part of the newest emerging industry of our time, should apply to support this team and this industry. We seek associates who bring experience in some of the following areas: licensing, corporate, real estate, land use, local government, or administrative defense.</p><p><b>Key Responsibilities: </b></p><ul><li>Stay current with the law surrounding state-wide regulation of medicinal and recreational marijuana, which involves questions of first impressions, conflicts between state and federal law, and a variety of novel legal and constitutional issues</li><li>Analyse the probable outcomes of cases or regulatory liability, using knowledge of legal precedents</li><li>Access the firm&#x2019;s extensive research to assist clients in preparing application materials</li><li>Responsible for legal review of license applications and renewals, compliance audits and the subsequent reports, in multiple states</li><li>Adapt to constant regulatory changes, yet identify and provide consistency in the firm&#x2019;s advice and messages</li><li>Communicate with clients to determine initial needs, get clarification on issues, and provide legal guidance</li><li>Represent clients in court or before government agencies</li><li>Interpret laws, rulings and regulations for individuals and businesses</li><li>Advise clients concerning business transactions, which can range in complexity from simple to complex</li><li>Prepare, draft, and review legal documents, such as contracts, leases, licenses, applications, appeals, real estate closing statements</li><li>Assist senior attorneys in advocating for policies that help state&#x2019;s responsible implementation of marijuana regulation</li><li>Developing and maintaining positive working relationships with court and agency staff to ensure the firm will be able to obtain and clarify timely information when needed</li><li>Contribute to the firm&#x2019;s success by continuously improving client relations, profitability, productivity and the collective expertise in marijuana law and the industry that defines VS.</li></ul><p><b>Skills: </b></p><ul><li>Innovative and forward thinking is required to work in emerging industry where research, education, product and service development, and change are originating at the grass roots level</li><li>Must be independent, self-directed, able to demonstrate resourcefulness and follow through to succeed in a fast-paced environment</li><li>Collaboration is required to contribute and build the firm&#x2019;s body of knowledge and understanding</li><li>Exceptional organization skills with high attention to detail</li><li>Excellent time and deadline management skills, able to juggle multiple projects and reprioritize quickly and efficiently</li><li>Must have strong interpersonal skills, ability to work with individuals, inside and outside the firm in a positive, collaborative manner</li><li>Excellent oral and written communication skills</li><li>Must be able to uphold highest standards of discretion, confidentiality, professional ethics and exercise good judgment on day-to-day decisions</li></ul><p><b>Tools and Technology: </b></p><ul><li>Required: Proficiency in Microsoft Office Suite, document management software</li><li>Preferred: Experience with Net Docs, Clio, Lexis/Nexis, Westlaw and DocuSign</li></ul><p><b>Education &amp; Experience: </b></p><ul><li>Juris Doctorate with 3 years practicing law required</li><li>Experience in business licensing, corporate, real estate, land use, local government, or administrative defense preferred</li><li>Knowledge and/or experience in the Cannabis Industry preferred</li></ul><p><b>Physical Requirements: </b></p><p>The work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.</p><ul><li>The position requires the employee to frequently sit and operate a computer and telephone with the ability to see details at close range (within a few feet of the observer)</li><li>General indoor office conditions in a temperature controlled environment</li><li>Low noise levels that can increase to moderate during group discussion and/or operation of basic office equipment such as copiers or printers</li></ul><p><i>Please note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice.</i></p><p><i>Vicente Sederberg is an equal opportunity employer and does not discriminate on the basis of race, religion, color national origin, age, sex, gender, disability or any other characteristic protected by law.</i></p><p>Job Type: Full-time</p><p>Required experience:</p><ul><li>law practice: 3 years</li></ul>","jobApplication":"https://www.indeed.com/cmp/Vicente-Sederberg,-LLC/jobs/Associate-Attorney-af44243165f69183"},
  {"_id":"a5b993921aaa4dd7","companyName":"Green Wise Consulting","jobTitle":"Associate Attorney","jobType":"Full-time","jobLocation":"Los Angeles, CA","date":"November 7, 2017","jobDescription":"<p><b>Job Summary</b></p><p>We are Growing!!</p><p>Green Wise Consulting a cannabis consulting law firm is looking for an Associate Attorney to join our team.</p><p>*The ideal candidate needs experience in one or more of the following areas: Land Use, Transactional, Real Estate, Regulatory Compliance, Administrative/Municipal Law and/or Cannabis.</p><p>*Must have experience in drafting legal documents.</p><p>*At least 2 years of relevant experience.</p><p>*Candidates must be Driven, Intelligent and Passionate!</p><p>*Must love dogs!</p><p>Location: Southern California</p><p>Travel: 10%-20% of travel within California required</p><p>Job Type: Full-time</p><p>Job Type: Full-time</p><p>Required experience:</p><ul><li>practicing Law: 2 years</li></ul>","jobApplication":"https://www.indeed.com/cmp/Green-Wise-Consulting/jobs/Associate-Attorney-a5b993921aaa4dd7"},
  {"_id":"de113134e01da559","companyName":"Zero Point Distribution","jobTitle":"Blockchain Engineer","jobType":"Full-time","jobLocation":"Los Angeles, CA","date":"November 4, 2017","jobDescription":"<p><b>Job Summary</b></p><p>Are you ready to change the world? I am!</p><p>Hello, my name is Robert Palma, I am the CEO for Zero Point Distribution, a Cannabis distribution company revolutionizing the industry through blockchain and automation. We are looking for candidates to develop new blockchain technologies to support Zero Point Distribution Supply Chain Management solutions. We are looking for a strategic thinker to lead and pioneer work in Blockchain technology applied to Supply Chain management that would help deliver superior user experiences for our customers in the further.</p><p>You will have the opportunity to work in a highly dynamic environment that embraces a start-up mindset and encourages exponential thinking. Together our team works to understand our changing world, identify new opportunities and take actions to design and innovate the future of distribution.</p><p><b>Responsibilities and Duties</b></p><p><b>Responsibilities</b></p><p>A Blockchain Engineer who can create our <b>Enterprise Resource Management</b> &quot;Seed to Sale&quot; and <b>Peer to Peer</b> marketplace leveraging the distributed ledger frameworks and code bases from Hyperledger project.</p><p>Those familiar with Hyperledger already know the great news, these projects already started and are nearly complete! Hyperledger is an open source platform started by IBM and Linux Foundation to provide enterprise-grade, open source, distributed ledger frameworks and code bases to support business use. Check out their edx course, Amazing!</p><p><b>Duties</b></p><ul><li>Create sprint planning and manage the releases for assigned modules</li><li>Develop architecture and technology of application modules including applications and platforms</li><li>Work closely with Engineering leadership for the venture to identify risks and opportunities</li><li>Present information to executive team regarding project updates, threats and accomplishments</li><li>Build technical strategy, technology blueprint, hiring and define tech best practices</li><li>Ensure consistent best practices, and procedures for software development, quality assurance, and maintenance.</li></ul><p><b>Qualifications and Skills</b></p><p><b>Required</b></p><ul><li>BS/MS degree in Computer Science, Engineering or a related subject</li><li>Experience as a full stack developer working with engineering or technical data.</li><li>High energy individual, questions existing processes / approaches, drives towards optimal software solutions with the design team&#x2019;s needs in mind.</li><li>Analytical &amp; quantitative mindset.</li><li>Experience developing with Go and Node.js programming languages, Node.js SDK, Java SDK, and CLI</li><li>Familiar with Just In Time Production</li><li>The following features installed on your computer: cURL, Node.js, npm package manager, Go language, Docker, and Docker Compose.</li><li>Strong programming skills in Go and/or C++</li></ul><p><b>PLUS</b></p><ul><li>Experience working with Blockchain frameworks and created business applications and platforms</li><li>Deep understanding of Hyperledger, Ethereum or other Blockchain technologies</li><li>Systems Engineering experience and has worked on diverse computing protocols, high-performance systems, and distributed technologies.</li><li>Deep experience with cloud technology stacks, security systems, transaction processing, and high availability technologies</li><li>Component level understanding of security protocol stacks and crypto libraries and functions</li><li>Experience with building service-based technologies including micro-services frameworks</li><li>Worked on a diverse set of full stack technologies including experience with web, scripting, and low-level system coding</li><li>Experience with building systems based on messaging, RESTful APIs and different types of symmetric and asymmetric encryption methods</li></ul><p>Job Types: Full-time, Part-time, Contract</p><p>Job Location:</p><ul><li>Los Angeles, CA</li></ul><p>Required education:</p><ul><li>Bachelor&apos;s</li></ul><p>Required experience:</p><ul><li>Blockchain Development: 1 year</li><li>Software Development: 4 years</li></ul>","jobApplication":"https://www.indeed.com/cmp/Cannaco-Supply/jobs/Blockchain-Engineer-de113134e01da559"} ]